{"abstraction": "Printed Circuit boards (PCBs) are one of the most important stages in making\nelectronic products. A small defect in PCBs can cause significant flaws in the\nfinal product. Hence, detecting all defects in PCBs and locating them is\nessential. In this paper, we propose an approach based on denoising\nconvolutional autoencoders for detecting defective PCBs and to locate the\ndefects. Denoising autoencoders take a corrupted image and try to recover the\nintact image. We trained our model with defective PCBs and forced it to repair\nthe defective parts. Our model not only detects all kinds of defects and\nlocates them, but it can also repair them as well. By subtracting the repaired\noutput from the input, the defective parts are located. The experimental\nresults indicate that our model detects the defective PCBs with high accuracy\n(97.5%) compare to state of the art works.", "title": "PCB Defect Detection Using Denoising Convolutional Autoencoders", "author": "Saeed Khalilian, Yeganeh Hallaj, Arian Balouchestani, Hossein Karshenas, Amir Mohammadi", "published": "2020-08-28", "arxiv_url": "http://arxiv.org/abs/2008.12589v1", "arxiv_id": "2008.12589v1"}
{"abstraction": "A Bill of Materials (BoM) is a list of all components on a printed circuit\nboard (PCB). Since BoMs are useful for hardware assurance, automatic BoM\nextraction (AutoBoM) is of great interest to the government and electronics\nindustry. To achieve a high-accuracy AutoBoM process, domain knowledge of PCB\ntext and logos must be utilized. In this study, we discuss the challenges\nassociated with automatic PCB marking extraction and propose 1) a plan for\ncollecting salient PCB marking data, and 2) a framework for incorporating this\ndata for automatic PCB assurance. Given the proposed dataset plan and\nframework, subsequent future work, implications, and open research\npossibilities are detailed.", "title": "Framework for Automatic PCB Marking Detection and Recognition for Hardware Assurance", "author": "Olivia P. Dizon-Paradis, Daniel E. Capecci, Nathan T. Jessurun, Damon L. Woodard, Mark M. Tehranipoor, Navid Asadizanjani", "published": "2023-07-24", "arxiv_url": "http://arxiv.org/abs/2307.13105v1", "arxiv_id": "2307.13105v1"}
{"abstraction": "Quality control is of vital importance during electronics production. As the\nmethods of producing electronic circuits improve, there is an increasing chance\nof solder defects during assembling the printed circuit board (PCB). Many\ntechnologies have been incorporated for inspecting failed soldering, such as\nX-ray imaging, optical imaging, and thermal imaging. With some advanced\nalgorithms, the new technologies are expected to control the production quality\nbased on the digital images. However, current algorithms sometimes are not\naccurate enough to meet the quality control. Specialists are needed to do a\nfollow-up checking. For automated X-ray inspection, joint of interest on the\nX-ray image is located by region of interest (ROI) and inspected by some\nalgorithms. Some incorrect ROIs deteriorate the inspection algorithm. The high\ndimension of X-ray images and the varying sizes of image dimensions also\nchallenge the inspection algorithms. On the other hand, recent advances on deep\nlearning shed light on image-based tasks and are competitive to human levels.\nIn this paper, deep learning is incorporated in X-ray imaging based quality\ncontrol during PCB quality inspection. Two artificial intelligence (AI) based\nmodels are proposed and compared for joint defect detection. The noised ROI\nproblem and the varying sizes of imaging dimension problem are addressed. The\nefficacy of the proposed methods are verified through experimenting on a\nreal-world 3D X-ray dataset. By incorporating the proposed methods, specialist\ninspection workload is largely saved.", "title": "Deep Learning Based Defect Detection for Solder Joints on Industrial X-Ray Circuit Board Images", "author": "Qianru Zhang, Meng Zhang, Chinthaka Gamanayake, Chau Yuen, Zehao Geng, Hirunima Jayasekara, Xuewen Zhang, Chia-wei Woo, Jenny Low, Xiang Liu", "published": "2020-08-06", "arxiv_url": "http://arxiv.org/abs/2008.02604v2", "arxiv_id": "2008.02604v2"}
{"abstraction": "Printed Circuit Boards are the foundation for the functioning of any\nelectronic device, and therefore are an essential component for various\nindustries such as automobile, communication, computation, etc. However, one of\nthe challenges faced by the PCB manufacturers in the process of manufacturing\nof the PCBs is the faulty placement of its components including missing\ncomponents. In the present scenario the infrastructure required to ensure\nadequate quality of the PCB requires a lot of time and effort. The authors\npresent a novel solution for detecting missing components and classifying them\nin a resourceful manner. The presented algorithm focuses on pixel theory and\nobject detection, which has been used in combination to optimize the results\nfrom the given dataset.", "title": "PCB-Fire: Automated Classification and Fault Detection in PCB", "author": "Tejas Khare, Vaibhav Bahel, Anuradha C. Phadke", "published": "2021-02-22", "arxiv_url": "http://arxiv.org/abs/2102.10777v1", "arxiv_id": "2102.10777v1"}
{"abstraction": "Alzheimer's Disease (AD) is a non-curable progressive neurodegenerative\ndisorder that affects the human brain, leading to a decline in memory,\ncognitive abilities, and eventually, the ability to carry out daily tasks.\nManual diagnosis of Alzheimer's disease from MRI images is fraught with less\nsensitivity and it is a very tedious process for neurologists. Therefore, there\nis a need for an automatic Computer Assisted Diagnosis (CAD) system, which can\ndetect AD at early stages with higher accuracy. In this research, we have\nproposed a novel AD-Lite Net model (trained from scratch), that could alleviate\nthe aforementioned problem. The novelties we bring here in this research are,\n(I) We have proposed a very lightweight CNN model by incorporating Depth Wise\nSeparable Convolutional (DWSC) layers and Global Average Pooling (GAP) layers.\n(II) We have leveraged a ``parallel concatenation block'' (pcb), in the\nproposed AD-Lite Net model. This pcb consists of a Transformation layer\n(Tx-layer), followed by two convolutional layers, which are thereby\nconcatenated with the original base model. This Tx-layer converts the features\ninto very distinct kind of features, which are imperative for the Alzheimer's\ndisease. As a consequence, the proposed AD-Lite Net model with ``parallel\nconcatenation'' converges faster and automatically mitigates the class\nimbalance problem from the MRI datasets in a very generalized way. For the\nvalidity of our proposed model, we have implemented it on three different MRI\ndatasets. Furthermore, we have combined the ADNI and AD datasets and\nsubsequently performed a 10-fold cross-validation experiment to verify the\nmodel's generalization ability. Extensive experimental results showed that our\nproposed model has outperformed all the existing CNN models, and one recent\ntrend Vision Transformer (ViT) model by a significant margin.", "title": "AD-Lite Net: A Lightweight and Concatenated CNN Model for Alzheimer's Detection from MRI Images", "author": "Santanu Roy, Archit Gupta, Shubhi Tiwari, Palak Sahu", "published": "2024-09-12", "arxiv_url": "http://arxiv.org/abs/2409.08170v1", "arxiv_id": "2409.08170v1"}
{"abstraction": "In this paper, a novel method to enhance Frequency Modulated Continuous Wave\n(FMCW) THz imaging resolution beyond its diffraction limit is proposed. Our\nmethod comprises two stages. Firstly, we reconstruct the signal in\ndepth-direction using a sinc-envelope, yielding a significant improvement in\ndepth estimation and signal parameter extraction. The resulting high precision\ndepth estimate is used to deduce an accurate reflection intensity THz image.\nThis image is fed in the second stage of our method to a 2D blind deconvolution\nprocedure, adopted to enhance the lateral THz image resolution beyond the\ndiffraction limit. Experimental data acquired with a FMCW system operating at\n577 GHz with a bandwidth of 126 GHz shows that the proposed method enhances the\nlateral resolution by a factor of 2.29 to 346.2um with respect to the\ndiffraction limit. The depth accuracy is 91um. Interestingly, the lateral\nresolution enhancement achieved with this blind deconvolution concept leads to\nbetter results in comparison to conventional gaussian deconvolution.\nExperimental data on a PCB resolution target is presented, in order to quantify\nthe resolution enhancement and to compare the performance with established\nimage enhancement approaches. The presented technique allows exposure of the\ninterwoven fibre reinforced embedded structures of the PCB test sample.", "title": "Computational Image Enhancement for Frequency Modulated Continuous Wave (FMCW) THz Image", "author": "Tak Ming Wong, Matthias Kahl, Peter Haring Bolívar, Andreas Kolb", "published": "2018-02-15", "arxiv_url": "http://arxiv.org/abs/1802.05457v3", "arxiv_id": "1802.05457v3"}
{"abstraction": "The prediction of upcoming events in industrial processes has been a\nlong-standing research goal since it enables optimization of manufacturing\nparameters, planning of equipment maintenance and more importantly prediction\nand eventually prevention of defects. While existing approaches have\naccomplished substantial progress, they are mostly limited to processing of one\ndimensional signals or require parameter tuning to model environmental\nparameters. In this paper, we propose an alternative approach based on deep\nneural networks that simulates changes in the 3D structure of a monitored\nobject in a batch based on previous 3D measurements. In particular, we propose\nan architecture based on 3D Convolutional Neural Networks (3DCNN) in order to\nmodel the geometric variations in manufacturing parameters and predict upcoming\nevents related to sub-optimal performance. We validate our framework on a\nmicroelectronics use-case using the recently published PCB scans dataset where\nwe simulate changes on the shape and volume of glue deposited on an Liquid\nCrystal Polymer (LCP) substrate before the attachment of integrated circuits\n(IC). Experimental evaluation examines the impact of different choices in the\ncost function during training and shows that the proposed method can be\nefficiently used for defect prediction.", "title": "A Deep Learning Framework for Simulation and Defect Prediction Applied in Microelectronics", "author": "Nikolaos Dimitriou, Lampros Leontaris, Thanasis Vafeiadis, Dimosthenis Ioannidis, Tracy Wotherspoon, Gregory Tinker, Dimitrios Tzovaras", "published": "2020-02-25", "arxiv_url": "http://arxiv.org/abs/2002.10986v1", "arxiv_id": "2002.10986v1"}
{"abstraction": "A common source of defects in manufacturing miniature Printed Circuits Boards\n(PCB) is the attachment of silicon die or other wire bondable components on a\nLiquid Crystal Polymer (LCP) substrate. Typically, a conductive glue is\ndispensed prior to attachment with defects caused either by insufficient or\nexcessive glue. The current practice in electronics industry is to examine the\ndeposited glue by a human operator a process that is both time consuming and\ninefficient especially in preproduction runs where the error rate is high. In\nthis paper we propose a system that automates fault diagnosis by accurately\nestimating the volume of glue deposits before and even after die attachment. To\nthis end a modular scanning system is deployed that produces high resolution\npoint clouds whereas the actual estimation of glue volume is performed by\n(R)egression-Net (RNet), a 3D Convolutional Neural Network (3DCNN). RNet\noutperforms other deep architectures and is able to estimate the volume either\ndirectly from the point cloud of a glue deposit or more interestingly after die\nattachment when only a small part of glue is visible around each die. The\nentire methodology is evaluated under operational conditions where the proposed\nsystem achieves accurate results without delaying the manufacturing process.", "title": "Fault Diagnosis in Microelectronics Attachment via Deep Learning Analysis of 3D Laser Scans", "author": "Nikolaos Dimitriou, Lampros Leontaris, Thanasis Vafeiadis, Dimosthenis Ioannidis, Tracy Wotherspoon, Gregory Tinker, Dimitrios Tzovaras", "published": "2020-02-25", "arxiv_url": "http://arxiv.org/abs/2002.10974v1", "arxiv_id": "2002.10974v1"}
{"abstraction": "Outsourced printed circuit board (PCB) fabrication necessitates increased\nhardware assurance capabilities. Several assurance techniques based on\nautomated optical inspection (AOI) have been proposed that leverage PCB images\nacquired using digital cameras. We review state-of-the-art AOI techniques and\nobserve a strong, rapid trend toward machine learning (ML) solutions. These\nrequire significant amounts of labeled ground truth data, which is lacking in\nthe publicly available PCB data space. We contribute the FICS PCB Image\nCollection (FPIC) dataset to address this need. Additionally, we outline new\nhardware security methodologies enabled by our data set.", "title": "FPIC: A Novel Semantic Dataset for Optical PCB Assurance", "author": "Nathan Jessurun, Olivia P. Dizon-Paradis, Jacob Harrison, Shajib Ghosh, Mark M. Tehranipoor, Damon L. Woodard, Navid Asadizanjani", "published": "2022-02-17", "arxiv_url": "http://arxiv.org/abs/2202.08414v2", "arxiv_id": "2202.08414v2"}
{"abstraction": "In the context of hardware trust and assurance, reverse engineering has been\noften considered as an illegal action. Generally speaking, reverse engineering\naims to retrieve information from a product, i.e., integrated circuits (ICs)\nand printed circuit boards (PCBs) in hardware security-related scenarios, in\nthe hope of understanding the functionality of the device and determining its\nconstituent components. Hence, it can raise serious issues concerning\nIntellectual Property (IP) infringement, the (in)effectiveness of\nsecurity-related measures, and even new opportunities for injecting hardware\nTrojans. Ironically, reverse engineering can enable IP owners to verify and\nvalidate the design. Nevertheless, this cannot be achieved without overcoming\nnumerous obstacles that limit successful outcomes of the reverse engineering\nprocess. This paper surveys these challenges from two complementary\nperspectives: image processing and machine learning. These two fields of study\nform a firm basis for the enhancement of efficiency and accuracy of reverse\nengineering processes for both PCBs and ICs. In summary, therefore, this paper\npresents a roadmap indicating clearly the actions to be taken to fulfill\nhardware trust and assurance objectives.", "title": "Hardware Trust and Assurance through Reverse Engineering: A Survey and Outlook from Image Analysis and Machine Learning Perspectives", "author": "Ulbert J. Botero, Ronald Wilson, Hangwei Lu, Mir Tanjidur Rahman, Mukhil A. Mallaiyan, Fatemeh Ganji, Navid Asadizanjani, Mark M. Tehranipoor, Damon L. Woodard, Domenic Forte", "published": "2020-02-11", "arxiv_url": "http://arxiv.org/abs/2002.04210v2", "arxiv_id": "2002.04210v2"}
{"abstraction": "Addressing the critical theme of recycling electronic waste (E-waste), this\ncontribution is dedicated to developing advanced automated data processing\npipelines as a basis for decision-making and process control. Aligning with the\nbroader goals of the circular economy and the United Nations (UN) Sustainable\nDevelopment Goals (SDG), our work leverages non-invasive analysis methods\nutilizing RGB and hyperspectral imaging data to provide both quantitative and\nqualitative insights into the E-waste stream composition for optimizing\nrecycling efficiency. In this paper, we introduce 'PCB-Vision'; a pioneering\nRGB-hyperspectral printed circuit board (PCB) benchmark dataset, comprising 53\nRGB images of high spatial resolution paired with their corresponding high\nspectral resolution hyperspectral data cubes in the visible and near-infrared\n(VNIR) range. Grounded in open science principles, our dataset provides a\ncomprehensive resource for researchers through high-quality ground truths,\nfocusing on three primary PCB components: integrated circuits (IC), capacitors,\nand connectors. We provide extensive statistical investigations on the proposed\ndataset together with the performance of several state-of-the-art (SOTA)\nmodels, including U-Net, Attention U-Net, Residual U-Net, LinkNet, and\nDeepLabv3+. By openly sharing this multi-scene benchmark dataset along with the\nbaseline codes, we hope to foster transparent, traceable, and comparable\ndevelopments of advanced data processing across various scientific communities,\nincluding, but not limited to, computer vision and remote sensing. Emphasizing\nour commitment to supporting a collaborative and inclusive scientific\ncommunity, all materials, including code, data, ground truth, and masks, will\nbe accessible at https://github.com/hifexplo/PCBVision.", "title": "PCB-Vision: A Multiscene RGB-Hyperspectral Benchmark Dataset of Printed Circuit Boards", "author": "Elias Arbash, Margret Fuchs, Behnood Rasti, Sandra Lorenz, Pedram Ghamisi, Richard Gloaguen", "published": "2024-01-12", "arxiv_url": "http://arxiv.org/abs/2401.06528v1", "arxiv_id": "2401.06528v1"}
{"abstraction": "To extend the antenna design on printed circuit boards (PCBs) for more\nengineers of interest, we propose a simple method that models PCB antennas with\na few basic components. By taking two separate steps to decide their geometric\ndimensions and positions, antenna prototypes can be facilitated with no\nexperience required. Random sampling statistics relate to the quality of\ndimensions are used in selecting among dimension candidates. A novel\nimage-based classifier using a convolutional neural network (CNN) is introduced\nto further determine the positions of these fixed-dimension components. Two\nexamples from wearable products have been chosen to examine the entire\nworkflow. Their final designs are realistic and their performance metrics are\nnot inferior to the ones designed by experienced engineers.", "title": "Image Classifier Based Generative Method for Planar Antenna Design", "author": "Yang Zhong, Weiping Dou, Andrew Cohen, Dia'a Bisharat, Yuandong Tian, Jiang Zhu, Qing Huo Liu", "published": "2023-12-16", "arxiv_url": "http://arxiv.org/abs/2401.06149v1", "arxiv_id": "2401.06149v1"}
{"abstraction": "Diseases such as diabetic retinopathy and age-related macular degeneration\npose a significant risk to vision, highlighting the importance of precise\nsegmentation of retinal vessels for the tracking and diagnosis of progression.\nHowever, existing vessel segmentation methods that heavily rely on\nencoder-decoder structures struggle to capture contextual information about\nretinal vessel configurations, leading to challenges in reconciling semantic\ndisparities between encoder and decoder features. To address this, we propose a\nnovel feature enhancement segmentation network (FES-Net) that achieves accurate\npixel-wise segmentation without requiring additional image enhancement steps.\nFES-Net directly processes the input image and utilizes four prompt\nconvolutional blocks (PCBs) during downsampling, complemented by a shallow\nupsampling approach to generate a binary mask for each class. We evaluate the\nperformance of FES-Net on four publicly available state-of-the-art datasets:\nDRIVE, STARE, CHASE, and HRF. The evaluation results clearly demonstrate the\nsuperior performance of FES-Net compared to other competitive approaches\ndocumented in the existing literature.", "title": "Feature Enhancer Segmentation Network (FES-Net) for Vessel Segmentation", "author": "Tariq M. Khan, Muhammad Arsalan, Shahzaib Iqbal, Imran Razzak, Erik Meijering", "published": "2023-09-07", "arxiv_url": "http://arxiv.org/abs/2309.03535v1", "arxiv_id": "2309.03535v1"}
