{"abstraction": "The usage of electronic devices increases, and becomes predominant in most\naspects of life. Surface Mount Technology (SMT) is the most common industrial\nmethod for manufacturing electric devices in which electrical components are\nmounted directly onto the surface of a Printed Circuit Board (PCB). Although\nthe expansion of electronic devices affects our lives in a productive way,\nfailures or defects in the manufacturing procedure of those devices might also\nbe counterproductive and even harmful in some cases. It is therefore desired\nand sometimes crucial to ensure zero-defect quality in electronic devices and\ntheir production. While traditional Image Processing (IP) techniques are not\nsufficient to produce a complete solution, other promising methods like Deep\nLearning (DL) might also be challenging for PCB inspection, mainly because such\nmethods require big adequate datasets which are missing, not available or not\nupdated in the rapidly growing field of PCBs. Thus, PCB inspection is\nconventionally performed manually by human experts. Unsupervised Learning (UL)\nmethods may potentially be suitable for PCB inspection, having learning\ncapabilities on the one hand, while not relying on large datasets on the other.\nIn this paper, we introduce ChangeChip, an automated and integrated change\ndetection system for defect detection in PCBs, from soldering defects to\nmissing or misaligned electronic elements, based on Computer Vision (CV) and\nUL. We achieve good quality defect detection by applying an unsupervised change\ndetection between images of a golden PCB (reference) and the inspected PCB\nunder various setting. In this work, we also present CD-PCB, a synthesized\nlabeled dataset of 20 pairs of PCB images for evaluation of defect detection\nalgorithms.", "title": "ChangeChip: A Reference-Based Unsupervised Change Detection for PCB Defect Detection", "author": "Yehonatan Fridman, Matan Rusanovsky, Gal Oren", "published": "2021-09-13", "arxiv_url": "http://arxiv.org/abs/2109.05746v1", "arxiv_id": "2109.05746v1"}
{"abstraction": "Economic and operational advantages have led the supply chain of printed\ncircuit boards (PCBs) to incorporate various untrusted entities. Any of the\nuntrusted entities are capable of introducing malicious alterations to\nfacilitate a functional failure or leakage of secret information during field\noperation. While researchers have been investigating the threat of malicious\nmodification within the scale of individual microelectronic components, the\npossibility of a board-level malicious manipulation has essentially been\nunexplored. In the absence of standard benchmarking solutions, prospective\ncountermeasures for PCB trust assurance are likely to utilize homegrown\nrepresentation of the attacks that undermines their evaluation and does not\nprovide scope for comparison with other techniques. In this paper, we have\ndeveloped the first-ever benchmarking solution to facilitate an unbiased and\ncomparable evaluation of countermeasures applicable to PCB trust assurance.\nBased on a taxonomy tailored for PCB-level alterations, we have developed\nhigh-level Trojan models. From these models, we have generated a custom pool of\nboard-level Trojan designs of varied complexity and functionality. We have also\ndeveloped a tool-flow for automatically inserting these Trojans into various\nPCB designs and generate the Trojan benchmarks (i.e., PCB designs with Trojan).\nThe tool-based Trojan insertion facilitate a comprehensive evaluation against\nlarge number of diverse Trojan implementations and application of data mining\nfor trust verification. Finally, with experimental measurements from a\nfabricated PCB, we analyze the stealthiness of the Trojan designs.", "title": "An Automated Framework for Board-level Trojan Benchmarking", "author": "Tamzidul Hoque, Shuo Yang, Aritra Bhattacharyay, Jonathan Cruz, Swarup Bhunia", "published": "2020-03-27", "arxiv_url": "http://arxiv.org/abs/2003.12632v1", "arxiv_id": "2003.12632v1"}
{"abstraction": "Printed circuit boards (PCBs) are widely used in most electrical and\nelectronic equipments or products. Hazardous substances such as Pb, Hg, Cd,\netc, can be present in high concentrations in PCBs and the degradation and\nrelease of these substances poses a huge threat to humans and the environment.\nTo investigation the chemical composition of PCBs in domestic market of China,\na practical micro-focus X-ray fluorescence system is setup to make the elements\nanalysis, especially for detecting hazardous substances. Collimator is adopted\nto focus the X-ray emitted from X-ray tube. BRUKER X-ray detector with\nproportional counter is used to detect the emitted fluorescence from the PCB\nsamples. Both single layer PCB samples and double layers PCB samples made of\nepoxy glass fiber are purchased from the domestic market of China. Besides, a\nMC55 wireless communication module made by SIEMENS in Germany is used as the\nreference material. Experimental results from the fluorescence spectrums of the\ntesting points of PCB samples show that, hazardous substances, mainly Pb and\nBr, are detected from the welding pads and substrates. In addition, statistical\ndata about the average relatively amount of the main substances in testing\npoints are also illustrated. It is verified that micro-XRF screening offers a\nsimple and quick qualitative measurement of hazardous substances in PCBs.", "title": "Investigation of measuring hazardous substances in printed circuit boards using the micro-focus X-ray fluorescence screening", "author": "M. L. Fu, D. Irzhak, R. Fakhrtdinov, M. Grigoriev, B. S. Quan, Z. C. Le, D. Roshchupkin", "published": "2014-09-16", "arxiv_url": "http://arxiv.org/abs/1409.4505v1", "arxiv_id": "1409.4505v1"}
{"abstraction": "Despite the rapid rise in social engineering attacks, not all employees are\nas compliant with information security policies (ISPs) to the extent that\norganisations expect them to be. ISP non-compliance is caused by a variety of\npsychological motivation. This study investigates the effect of psychological\ncontract breach (PCB) of employees on ISP compliance intention (ICI) by\ndividing them into intrinsic and extrinsic motivation using the theory of\nplanned behaviour (TPB) and the general deterrence theory (GDT). Data analysis\nfrom UK employees (\\textit{n=206}) showed that the higher the PCB, the lower\nthe ICI. The study also found that PCBs significantly reduced intrinsic\nmotivation (attitude and perceived fairness) for ICI, whereas PCBs did not\nmoderate the relationship between extrinsic motivation (sanction severity and\nsanctions certainty) and ICI. As a result, this study successfully addresses\nthe risks of PCBs in the field of IS security and proposes effective solutions\nfor employees with high PCBs.", "title": "The impact of an employee's psychological contract breach on compliance with information security policies: intrinsic and extrinsic motivation", "author": "Daeun Lee, Harjinder Singh Lallie, Nadine Michaelides", "published": "2023-07-06", "arxiv_url": "http://arxiv.org/abs/2307.02916v1", "arxiv_id": "2307.02916v1"}
{"abstraction": "The adoption of 3D packaging technology necessitates the development of new\napproaches to failure electronic device analysis. To that end, our team is\ndeveloping a tool called the quantum diamond microscope (QDM) that leverages an\nensemble of nitrogen vacancy (NV) centers in diamond, achieving vector magnetic\nimaging with a wide field-of-view and high spatial resolution under ambient\nconditions. Here, we present the QDM measurement of 2D current distributions in\nan 8-nm flip chip IC and 3D current distributions in a multi-layer PCB.\nMagnetic field emanations from the C4 bumps in the flip chip dominate the QDM\nmeasurements, but these prove to be useful for image registration and can be\nsubtracted to resolve adjacent current traces in the die at the micron scale.\nVias in 3D ICs display only Bx and By magnetic fields due to their vertical\norientation and are difficult to detect with magnetometers that only measure\nthe Bz component (orthogonal to the IC surface). Using the multi-layer PCB, we\nshow that the QDM's ability to simultaneously measure Bx, By, and Bz is\nadvantageous for resolving magnetic fields from vias as current passes between\nlayers. We also show how spacing between conducting layers is determined by\nmagnetic field images and how it agrees with the design specifications of the\nPCB. In our initial efforts to provide further z-depth information for current\nsources in complex 3D circuits, we show how magnetic field images of individual\nlayers can be subtracted from the magnetic field image of the total structure.\nThis allows for isolation of signal layers and can be used to map embedded\ncurrent paths via solution of the 2D magnetic inverse. In addition, the paper\nalso discusses the use of neural networks to identify 2D current distributions\nand its potential for analyzing 3D structures.", "title": "Vector Magnetic Current Imaging of an 8 nm Process Node Chip and 3D Current Distributions Using the Quantum Diamond Microscope", "author": "Sean M. Oliver, Dmitro J. Martynowych, Matthew J. Turner, David A. Hopper, Ronald L. Walsworth, Edlyn V. Levine", "published": "2022-02-16", "arxiv_url": "http://arxiv.org/abs/2202.08135v1", "arxiv_id": "2202.08135v1"}
{"abstraction": "The quality control of printed circuit boards (PCBs) is paramount in\nadvancing electronic device technology. While numerous machine learning\nmethodologies have been utilized to augment defect detection efficiency and\naccuracy, previous studies have predominantly focused on optimizing individual\nmodels for specific defect types, often overlooking the potential synergies\nbetween different approaches. This paper introduces a comprehensive inspection\nframework leveraging an ensemble learning strategy to address this gap.\nInitially, we utilize four distinct PCB defect detection models utilizing\nstate-of-the-art methods: EfficientDet, MobileNet SSDv2, Faster RCNN, and\nYOLOv5. Each method is capable of identifying PCB defects independently.\nSubsequently, we integrate these models into an ensemble learning framework to\nenhance detection performance. A comparative analysis reveals that our ensemble\nlearning framework significantly outperforms individual methods, achieving a\n95% accuracy in detecting diverse PCB defects. These findings underscore the\nefficacy of our proposed ensemble learning framework in enhancing PCB quality\ncontrol processes.", "title": "Enhancing Printed Circuit Board Defect Detection through Ensemble Learning", "author": "Ka Nam Canaan Law, Mingshuo Yu, Lianglei Zhang, Yiyi Zhang, Peng Xu, Jerry Gao, Jun Liu", "published": "2024-09-14", "arxiv_url": "http://arxiv.org/abs/2409.09555v1", "arxiv_id": "2409.09555v1"}
{"abstraction": "This paper presents a challenging computer vision task, namely the detection\nof generic components on a PCB, and a novel set of deep-learning methods that\nare able to jointly leverage the appearance of individual components and the\npropagation of information across the structure of the board to accurately\ndetect and identify various types of components on a PCB. Due to the expense of\nmanual data labeling, a highly unbalanced distribution of component types, and\nsignificant domain shift across boards, most earlier attempts based on\ntraditional image processing techniques fail to generalize well to PCB images\nwith various quality, lighting conditions, etc. Newer object detection\npipelines such as Faster R-CNN, on the other hand, require a large amount of\nlabeled data, do not deal with domain shift, and do not leverage structure. To\naddress these issues, we propose a three stage pipeline in which a\nclass-agnostic region proposal network is followed by a low-shot similarity\nprediction classifier. In order to exploit the data dependency within a PCB, we\ndesign a novel Graph Network block to refine the component features conditioned\non each PCB. To the best of our knowledge, this is one of the earliest attempts\nto train a deep learning based model for such tasks, and we demonstrate\nimprovements over recent graph networks for this task. We also provide in-depth\nanalysis and discussion for this challenging task, pointing to future research.", "title": "Data-Efficient Graph Embedding Learning for PCB Component Detection", "author": "Chia-Wen Kuo, Jacob Ashmore, David Huggins, Zsolt Kira", "published": "2018-11-16", "arxiv_url": "http://arxiv.org/abs/1811.06994v2", "arxiv_id": "1811.06994v2"}
{"abstraction": "In recent years, Printed Circuit Boards (PCB) have become the backbone of a\nlarge number of consumer electronic devices leading to a surge in their\nproduction. This has made it imperative to employ automatic inspection systems\nto identify manufacturing defects in PCB before they are installed in the\nrespective systems. An important task in this regard is the classification of\ndefects as either true or pseudo defects, which decides if the PCB is to be\nre-manufactured or not. This work proposes a novel approach to detect most\ncommon defects in the PCBs. The problem has been approached by employing highly\ndiscriminative features based on multi-scale wavelet transform, which are\nfurther boosted by using a kernalized version of the support vector machines\n(SVM). A real world printed circuit board dataset has been used for\nquantitative analysis. Experimental results demonstrated the efficacy of the\nproposed method.", "title": "Pseudo vs. True Defect Classification in Printed Circuits Boards using Wavelet Features", "author": "Sahil Sikka, Karan Sikka, M. K. Bhuyan, Yuji Iwahori", "published": "2013-10-24", "arxiv_url": "http://arxiv.org/abs/1310.6654v1", "arxiv_id": "1310.6654v1"}
{"abstraction": "CubeSats are miniature satellites used to carry experimental payloads into\norbit, where it is often critical to precisely control their attitude. One way\nto do this is through the use of magnetorquers, which can be integrated into\nPCBs. This technique saves considerable space and capital when compared with\nmore common torque-rod magnetorquer systems. Here we derive a method of\nanalyzing different PCB-integrated magnetorquer geometries, parametrizing them\nsuch that the magnetic moment and efficiency are optimized. Furthermore, by\nmodulating the trace width, the trace number, and other electrical\ncharacteristics of the magnetorquer coil, this paper optimizes the generated\nmagnetic moment. Both constant voltage and constant current sources are\nanalyzed as inputs. These optimizations are then simulated in COMSOL for\nmultiple geometries, and it is found that there exists an optimal geometry,\ngiven a specified power dissipation. Simulations verify the general trend and\nmaxima of these derivations, barring small, consistent re-scaling in the\nmagnitude of the coil resistance. It is also found that these PCB-integrated\nmagnetorquers provide a sufficient alternative to commercial coil magnetorquers\n- particularly in volume-restricted configurations. This study extends such\nanalysis to larger CubeSat configurations, and finds that these larger\nimplementations increase magnetorquer efficiency. Optimizations for common\nPCB-implementable geometries on small satellites are tabulated in the Appendix.", "title": "Efficiency-optimized design of PCB-integrated magnetorquers for CubeSats", "author": "Nicholas J. Sorensen", "published": "2020-09-17", "arxiv_url": "http://arxiv.org/abs/2009.07981v2", "arxiv_id": "2009.07981v2"}
{"abstraction": "Delay Deviation Exceedance (DDE) and Differential Skew Exceedance (DSE)\nmeasures are proposed to quantify delay uncertainty in single-ended and\ndifferential PCB interconnects arising from Fiber Weave Effect (FWE). DDE and\nDSE are constructed with 3D EM analysis of traces over inhomogeneous dielectric\nwith glass fiber bundles in resin. Measurements or 3D EM models for FWE are\nusually used for observations of delay or impedance dependency on position of\ntraces over fiber bundles with the purpose to find the worst case scenario.\nThis paper turns the results of 3D EM analysis into probabilistic measures of\npossible delay or skew uncertainty - probability to have delay deviation in\nsingle-ended interconnects over allowed limit (DDE measure) or to have skew\nover allowed limit in differential interconnects (DSE measure). The introduced\nmeasures allow formalizing the laminate selection process for parallel as well\nas for serial PCB interconnects.", "title": "Evaluation of Delay Uncertainty in PCB Interconnects Due to Fiber Weave Effect", "author": "Alex Manukovsky, Yuriy Shlepnev, Shimon Mordooch", "published": "2022-10-11", "arxiv_url": "http://arxiv.org/abs/2210.05779v1", "arxiv_id": "2210.05779v1"}
{"abstraction": "In this paper, the DSSC safety-interlock system is introduced. It is designed\nto keep the DSSC mega-pixel camera in a safe-state. The system is composed of\nfour inter-communicating sub-systems referred here as a master SIB\n(safety-interlock board) and three partner SIBs. Each SIB monitors and\nprocesses 75 temperature sensors mainly located in the focal plane and also\ndistributed inside the camera-head electronics. It monitors the signals from\ntwo pressure sensors, one humidity sensor as well as the connectivity to\nsixteen low-voltage and two high-voltage cables. The master SIB supervises the\nsignals to and from external equipments like the cooling system, pressure\ngauge, power crates and status information from experimental environment. SIB\nis an 8-layer printed-circuit board (PCB) with a micro-controller sitting on\ntop as its central processing unit. A decision-matrix software reads the sensor\nstatus continuously and determines whether the camera is in a safe state or\nnot. All error and warnings flags are sent to the detector control software\nframework and the end user directly. These flags are also stored every 100 ms\ntogether with the image data. The full SIB sensor data is sent to the back end\nfor offline analysis. A shutdown sequence is initiated by SIB in case of a\ncritical failure. The safety-interlock philosophy, hardware design, and\nsoftware architecture along with test results will be presented.", "title": "Safety-Interlock System of the DSSC X-Ray Imager", "author": "Sneha Nidhi, Helmut Klaer, Karsten Hansen, Monica Turcato, Markus Kuster, Matteo Porro", "published": "2016-12-12", "arxiv_url": "http://arxiv.org/abs/1612.03642v1", "arxiv_id": "1612.03642v1"}
{"abstraction": "We introduce the ParClusterers Benchmark Suite (PCBS) -- a collection of\nhighly scalable parallel graph clustering algorithms and benchmarking tools\nthat streamline comparing different graph clustering algorithms and\nimplementations.\n  The benchmark includes clustering algorithms that target a wide range of\nmodern clustering use cases, including community detection, classification, and\ndense subgraph mining.\n  The benchmark toolkit makes it easy to run and evaluate multiple instances of\ndifferent clustering algorithms, which can be useful for fine-tuning the\nperformance of clustering on a given task, and for comparing different\nclustering algorithms based on different metrics of interest, including\nclustering quality and running time.\n  Using PCBS, we evaluate a broad collection of real-world graph clustering\ndatasets. Somewhat surprisingly, we find that the best quality results are\nobtained by algorithms that not included in many popular graph clustering\ntoolkits. The PCBS provides a standardized way to evaluate and judge the\nquality-performance tradeoffs of the active research area of scalable graph\nclustering algorithms. We believe it will help enable fair, accurate, and\nnuanced evaluation of graph clustering algorithms in the future.", "title": "The ParClusterers Benchmark Suite (PCBS): A Fine-Grained Analysis of Scalable Graph Clustering", "author": "Shangdi Yu, Jessica Shi, Jamison Meindl, David Eisenstat, Xiaoen Ju, Sasan Tavakkol, Laxman Dhulipala, Jakub Łącki, Vahab Mirrokni, Julian Shun", "published": "2024-11-15", "arxiv_url": "http://arxiv.org/abs/2411.10290v1", "arxiv_id": "2411.10290v1"}
{"abstraction": "Pressure-volume-temperature data, along with dielectric relaxation\nmeasurements, are reported for a series of polychlorinated biphenyls (PCB),\ndiffering in the number of chlorine atoms on their phenyl rings. Analysis of\nthe results reveals that with increasing chlorine content, the relaxation times\nof the PCB become governed to a greater degree by density, rho, relative to the\neffect of temperature, T. This result is consistent with the respective\nmagnitudes of the scaling exponent, gamma, yielding superpositioning of the\nrelaxation times measured at various temperatures and pressures, when plotted\nversus rho^gamma/T. While at constant (atmospheric) pressure, fragilities for\nthe various PCB are equivalent, the fragility at constant volume varies\ninversely with chlorine content. Evidently, the presence of bulkier chlorine\natoms on the phenyl rings magnifies the effect density has on the relaxation\ndynamics.", "title": "Effect of Chemical Structure on the Isobaric and Isochoric Fragility in Polychlorinated Biphenyls", "author": "C. M. Roland, R. Casalini", "published": "2005-01-06", "arxiv_url": "http://arxiv.org/abs/cond-mat/0501123v1", "arxiv_id": "cond-mat/0501123v1"}
{"abstraction": "Compound-specific chlorine/bromine isotope analysis (CSIA-Cl/Br) has become a\nuseful approach for degradation pathway investigation and source appointment of\nhalogenated organic pollutants (HOPs). CSIA-Cl/Br is usually conducted by gas\nchromatography-mass spectrometry (GC-MS), which could be negatively impacted by\nchlorine and bromine isotope fractionation of HOPs on GC columns. In this\nstudy, 31 organochlorines and 4 organobromines were systematically investigated\nin terms of Cl/Br isotope fractionation on GC columns using GC-double focus\nmagnetic-sector high resolution MS (GC-DFS-HRMS). On-column chlorine/bromine\nisotope fractionation behaviors of the HOPs were explored, presenting various\nisotope fractionation modes and extents. Twenty-nine HOPs exhibited inverse\nisotope fractionation, and only polychlorinated biphenyl-138 (PCB-138) and\nPCB-153 presented normal isotope fractionation. And no observable isotope\nfractionation was found for the rest four HOPs, i.e., PCB-101,\n1,2,3,7,8-pentachlorodibenzofuran, PCB-180 and 2,3,7,8-tetrachlorodibenzofuran.\nThe isotope fractionation extents of different HOPs varied from below the\nobservable threshold (0.50%) to 7.31% (PCB-18). The mechanisms of the on-column\nchlorine/bromine isotope fractionation were tentatively interpreted with the\nCraig-Gordon model and a modified two-film model. Inverse isotope effects and\nnormal isotope effects might contribute to the total isotope effects together\nand thus determine the isotope fractionation directions and extents. Proposals\nderived from the main results of this study for CSIA-Cl/Br research were\nprovided for improving the precision and accuracy of CSIA-Cl/Br results. The\nfindings of this study will shed light on the development of CSIA-Cl/Br methods\nusing GC-MS techniques, and help to implement the research using CSIA-Cl/Br to\ninvestigate the environmental behaviors and pollution sources of HOPs.", "title": "Chlorine and Bromine Isotope Fractionation of Halogenated Organic Pollutants on Gas Chromatography Columns", "author": "Caiming Tang, Jianhua Tan, Songsong Xiong, Jun Liu, Yujuan Fan, Xianzhi Peng", "published": "2017-02-08", "arxiv_url": "http://arxiv.org/abs/1702.02565v1", "arxiv_id": "1702.02565v1"}
{"abstraction": "PCB (printed circuit board) substrates are often single-use, leading to\nmaterial waste in electronics making. We introduce PCB Renewal, a novel\ntechnique that \"erases\" and \"reconfigures\" PCB traces by selectively depositing\nconductive epoxy onto outdated areas, transforming isolated paths into\nconductive planes that support new traces. We present the PCB Renewal workflow,\nevaluate its electrical performance and mechanical durability, and model its\nsustainability impact, including material usage, cost, energy consumption, and\ntime savings. We develop a software plug-in that guides epoxy deposition,\ngenerates updated PCB profiles, and calculates resource usage. To demonstrate\nPCB Renewal's effectiveness and versatility, we repurpose a single PCB across\nfour design iterations spanning three projects: a camera roller, a WiFi radio,\nand an ESPboy game console. We also show how an outsourced double-layer PCB can\nbe reconfigured, transforming it from an LED watch to an interactive cat toy.\nThe paper concludes with limitations and future directions.", "title": "PCB Renewal: Iterative Reuse of PCB Substrates for Sustainable Electronic Making", "author": "Zeyu Yan, Advait Vartak, Jiasheng Li, Zining Zhang, Huaishu Peng", "published": "2025-02-18", "arxiv_url": "http://arxiv.org/abs/2502.13255v1", "arxiv_id": "2502.13255v1"}
{"abstraction": "In this paper, a highly compact, low power (<10W), high frequency (2 MHz)\nisolated active clamp forward converter, comprising a coreless Printed Circuit\nBoard-based transformer is proposed. To decrease the size of converter, high\nswitching frequency is considered which lead to decrease in inductor, capacitor\nand transformer size. Highly switch loss due to hard switching is an important\nconstraint of forward topology to increase frequency. In this paper, the active\nclamp circuit is added to forward topology to achieve zero voltage switching\nand decrease switching loss drastically. Due to zero voltage switching, the\nproposed converter can operate in high frequency. The principle of active clamp\nforward converter is described in this paper. Another constraint to increase\nthe switching frequency of forward converter is transformer core losses. In\nthis paper, coreless PCB-based transformer is proposed and implemented to be\nutilized in the structure of the active clamp forward converter. Instead of\nclassic core-based transformer, using a PCB-based transformer as the power\ntransmitter has increased the efficiency due to elimination of core hysteresis\nloss. The equivalent circuit, transfer function and input impedance of\nPCB-based coreless transformer are presented in high frequency. Finally, an\nexperimental prototype of the active clamp forward converter which uses a\ncoreless transformer is implemented. The experimental results of proposed\nconverter are presented to evaluate the theoretical analysis and performance.", "title": "A High Frequency Active Clamp Forward Converter with Coreless Transformer", "author": "Reza Asrar Ghaderloo, Ali Parsa Sirat, Abbas Shoulaie", "published": "2023-07-24", "arxiv_url": "http://arxiv.org/abs/2307.12804v1", "arxiv_id": "2307.12804v1"}
{"abstraction": "In the rapidly growing field of electronic design automation (EDA),\nprofessional software such as KiCad, Cadence , and Altium Designer provide\nincreasingly extensive design functionalities. However, the intricate command\nstructure and high learning curve create a barrier, particularly for novice\nprinted circuit board (PCB) designers. This results in difficulties in\nselecting appropriate functions or plugins for varying design purposes,\ncompounded by the lack of intuitive learning methods beyond traditional\ndocumentation, videos, and online forums. To address this challenge, an\nartificial intelligence (AI) interaction assist plugin for EDA software named\nSmartonAl is developed here, also KiCad is taken as the first example.\nSmartonAI is inspired by the HuggingGPT framework and employs large language\nmodels, such as GPT and BERT, to facilitate task planning and execution. On\nreceiving a designer request, SmartonAI conducts a task breakdown and\nefficiently executes relevant subtasks, such as analysis of help documentation\nparagraphs and execution of different plugins, along with leveraging the\nbuilt-in schematic and PCB manipulation functions in both SmartonAl itself and\nsoftware. Our preliminary results demonstrate that SmartonAI can significantly\nstreamline the PCB design process by simplifying complex commands into\nintuitive language-based interactions. By harnessing the powerful language\ncapabilities of ChatGPT and the rich design functions of KiCad, the plugin\neffectively bridges the gap between complex EDA software and user-friendly\ninteraction. Meanwhile, the new paradigm behind SmartonAI can also extend to\nother complex software systems, illustrating the immense potential of\nAI-assisted user interfaces in advancing digital interactions across various\ndomains.", "title": "New Interaction Paradigm for Complex EDA Software Leveraging GPT", "author": "Boyu Han, Xinyu Wang, Yifan Wang, Junyu Yan, Yidong Tian", "published": "2023-07-27", "arxiv_url": "http://arxiv.org/abs/2307.14740v1", "arxiv_id": "2307.14740v1"}
{"abstraction": "Electronics are integral to modern life; however, at their end-of-life these\ndevices produce environmentally hazardous electronic waste (e-waste). Recycling\nthe ubiquitous printed circuit boards (PCBs) that make up a substantial mass\nand volume fraction of e-waste is challenging due to their use of irreversibly\ncured thermoset epoxies. We present a PCB formulation using transesterification\nvitrimers (vPCBs), and an end-to-end fabrication process compatible with\nstandard manufacturing ecosystems. We create functional prototypes of IoT\ndevices transmitting 2.4 GHz radio signals on vPCBs with electrical and\nmechanical properties meeting industry standards. Fractures and holes in vPCBs\ncan be repaired while retaining comparable performance over more than four\nrepair cycles. We further demonstrate non-destructive decomposition of\ntransesterification vitrimer composites with solid inclusions and metal\nattachments by polymer swelling with small molecule solvents. We hypothesize\nthat unlike traditional solvolysis recycling, swelling does not degrade the\nmaterials. Through dynamic mechanical analysis we find negligible catalyst\nloss, minimal changes in storage modulus, and equivalent polymer backbone\ncomposition across multiple recycling cycles. We achieve 98% polymer recovery,\n100% fiber recovery, and 91% solvent recovery which we reuse to create new\nvPCBs without degraded performance. Our cradle-to-cradle life-cycle assessment\nshows substantial environmental impact reduction over conventional PCBs in 11\ncategories.", "title": "Recyclable vitrimer-based printed circuit board for circular electronics", "author": "Zhihan Zhang, Agni K. Biswal, Ankush Nandi, Kali Frost, Jake A. Smith, Bichlien H. Nguyen, Shwetak Patel, Aniruddh Vashisth, Vikram Iyer", "published": "2023-08-24", "arxiv_url": "http://arxiv.org/abs/2308.12496v1", "arxiv_id": "2308.12496v1"}
{"abstraction": "Addressing the critical theme of recycling electronic waste (E-waste), this\ncontribution is dedicated to developing advanced automated data processing\npipelines as a basis for decision-making and process control. Aligning with the\nbroader goals of the circular economy and the United Nations (UN) Sustainable\nDevelopment Goals (SDG), our work leverages non-invasive analysis methods\nutilizing RGB and hyperspectral imaging data to provide both quantitative and\nqualitative insights into the E-waste stream composition for optimizing\nrecycling efficiency. In this paper, we introduce 'PCB-Vision'; a pioneering\nRGB-hyperspectral printed circuit board (PCB) benchmark dataset, comprising 53\nRGB images of high spatial resolution paired with their corresponding high\nspectral resolution hyperspectral data cubes in the visible and near-infrared\n(VNIR) range. Grounded in open science principles, our dataset provides a\ncomprehensive resource for researchers through high-quality ground truths,\nfocusing on three primary PCB components: integrated circuits (IC), capacitors,\nand connectors. We provide extensive statistical investigations on the proposed\ndataset together with the performance of several state-of-the-art (SOTA)\nmodels, including U-Net, Attention U-Net, Residual U-Net, LinkNet, and\nDeepLabv3+. By openly sharing this multi-scene benchmark dataset along with the\nbaseline codes, we hope to foster transparent, traceable, and comparable\ndevelopments of advanced data processing across various scientific communities,\nincluding, but not limited to, computer vision and remote sensing. Emphasizing\nour commitment to supporting a collaborative and inclusive scientific\ncommunity, all materials, including code, data, ground truth, and masks, will\nbe accessible at https://github.com/hifexplo/PCBVision.", "title": "PCB-Vision: A Multiscene RGB-Hyperspectral Benchmark Dataset of Printed Circuit Boards", "author": "Elias Arbash, Margret Fuchs, Behnood Rasti, Sandra Lorenz, Pedram Ghamisi, Richard Gloaguen", "published": "2024-01-12", "arxiv_url": "http://arxiv.org/abs/2401.06528v1", "arxiv_id": "2401.06528v1"}
{"abstraction": "Automated detection of defects in Printed Circuit Board (PCB) manufacturing\nusing Solder Paste Inspection (SPI) and Automated Optical Inspection (AOI)\nmachines can help improve operational efficiency and significantly reduce the\nneed for manual intervention. In this paper, using SPI-extracted features of 6\nmillion pins, we demonstrate a data-centric approach to train Machine Learning\n(ML) models to detect PCB defects at three stages of PCB manufacturing. The 6\nmillion PCB pins correspond to 2 million components that belong to 15,387 PCBs.\nUsing a base extreme gradient boosting (XGBoost) ML model, we iterate on the\ndata pre-processing step to improve detection performance. Combining pin-level\nSPI features using component and PCB IDs, we developed training instances also\nat the component and PCB level. This allows the ML model to capture any\ninter-pin, inter-component, or spatial effects that may not be apparent at the\npin level. Models are trained at the pin, component, and PCB levels, and the\ndetection results from the different models are combined to identify defective\ncomponents.", "title": "Detecting Manufacturing Defects in PCBs via Data-Centric Machine Learning on Solder Paste Inspection Features", "author": "Jubilee Prasad-Rao, Roohollah Heidary, Jesse Williams", "published": "2023-09-06", "arxiv_url": "http://arxiv.org/abs/2309.03113v1", "arxiv_id": "2309.03113v1"}
{"abstraction": "We will describe the thermal performance of power semiconductor module, which\nconsists of hetero-junction bipolar transistors (HBTs), for mobile\ncommunication systems. We calculate the thermal resistance between the HBT\nfingers and the bottom surface of a multi-layer printed circuit board (PCB)\nusing a finite element method (FEM). We applied a steady state analysis to\nevaluate the influence of design parameters on thermal resistance of the\nmodule. We found that the thickness of GaAs substrate, the thickness of\nmulti-layer circuit board, the thermal conductivity of bonding material under\nGaAs substrate, and misalignment of thermal vias between each layer of PCB are\nthe dominant parameter in thermal resistance of the module.", "title": "Thermal Design of Power Semiconductor Modules for Mobile Communication Systems", "author": "Y. Osone", "published": "2007-09-12", "arxiv_url": "http://arxiv.org/abs/0709.1879v1", "arxiv_id": "0709.1879v1"}
{"abstraction": "In the realm of PCB and packaging interconnect design, electromagnetic\nanalysis tools have transitioned from optional to essential over the last two\ndecades, as data rates soared beyond 6 Gbps. Today, with standard data rates\neclipsing 6 Gbps and reaching thresholds of 224 Gbps, these tools are\nindispensable for designing reliable interconnects. The goals of the\ninterconnect analysis are simple: identify interconnects that may fail at the\ntarget data rate and allow troubleshooting and fixing the problem. The most\nefficient approach to such pass-fail analysis is the Decompositional\nElectromagnetic Analysis (DEA). It allows separation of the signal degradation\nfactors for faster analysis and troubleshooting. This paper outlines the basic\nelements of DEA, discusses conditions for its accuracy and underscores its\nsignificance in the future of interconnect design.", "title": "Progress in Decompositional Electromagnetic Analysis of Digital Interconnects", "author": "Yuriy Shlepnev", "published": "2024-12-07", "arxiv_url": "http://arxiv.org/abs/2412.09639v1", "arxiv_id": "2412.09639v1"}
{"abstraction": "We report our experience of using failure symptoms, such as error messages or\nstack traces, to identify flaky test failures in a Continuous Integration (CI)\npipeline for a large industrial software system, SAP HANA. Although failure\nsymptoms are commonly used to identify similar failures, they have not\npreviously been employed to detect flaky test failures. Our hypothesis is that\nflaky failures will exhibit symptoms distinct from those of non-flaky failures.\nConsequently, we can identify recurring flaky failures, without rerunning the\ntests, by matching the failure symptoms to those of historical flaky runs. This\ncan significantly reduce the need for test reruns, ultimately resulting in\nfaster delivery of test results to developers. To facilitate the process of\nmatching flaky failures across different execution instances, we abstract newer\ntest failure symptoms before matching them to the known patterns of flaky\nfailures, inspired by previous research in the fields of failure deduplication\nand log analysis. We evaluate our symptom-based flakiness detection method\nusing actual failure symptoms gathered from CI data of SAP HANA during a\nsix-month period. Our method shows the potential of using failure symptoms to\nidentify recurring flaky failures, achieving a precision of at least 96%, while\nsaving approximately 58% of the machine time compared to the traditional rerun\nstrategy. Analysis of the false positives and the feedback from developers\nunderscore the importance of having descriptive and informative failure\nsymptoms for both the effective deployment of this symptom-based approach and\nthe debugging of flaky tests.", "title": "Just-in-Time Flaky Test Detection via Abstracted Failure Symptom Matching", "author": "Gabin An, Juyeon Yoon, Thomas Bach, Jingun Hong, Shin Yoo", "published": "2023-10-10", "arxiv_url": "http://arxiv.org/abs/2310.06298v2", "arxiv_id": "2310.06298v2"}
{"abstraction": "Together with the Kirchhoff-Institute for Physics(KIP) the Fraunhofer IZM has\ndeveloped a full wafer redistribution and embedding technology as base for a\nlarge-scale neuromorphic hardware system. The paper will give an overview of\nthe neuromorphic computing platform at the KIP and the associated hardware\nrequirements which drove the described technological developments. In the first\nphase of the project standard redistribution technologies from wafer level\npackaging were adapted to enable a high density reticle-to-reticle routing on\n200mm CMOS wafers. Neighboring reticles were interconnected across the scribe\nlines with an 8{\\mu}m pitch routing based on semi-additive copper\nmetallization. Passivation by photo sensitive benzocyclobutene was used to\nenable a second intra-reticle routing layer. Final IO pads with flash gold were\ngenerated on top of each reticle. With that concept neuromorphic systems based\non full wafers could be assembled and tested. The fabricated high density\ninter-reticle routing revealed a very high yield of larger than 99.9%. In order\nto allow an upscaling of the system size to a large number of wafers with\nfeasible effort a full wafer embedding concept for printed circuit boards was\ndeveloped and proven in the second phase of the project. The wafers were\nthinned to 250{\\mu}m and laminated with additional prepreg layers and copper\nfoils into a core material. After lamination of the PCB panel the reticle IOs\nof the embedded wafer were accessed by micro via drilling, copper\nelectroplating, lithography and subtractive etching of the PCB wiring\nstructure. The created wiring with 50um line width enabled an access of the\nreticle IOs on the embedded wafer as well as a board level routing. The panels\nwith the embedded wafers were subsequently stressed with up to 1000 thermal\ncycles between 0C and 100C and have shown no severe failure formation over the\ncycle time.", "title": "Full Wafer Redistribution and Wafer Embedding as Key Technologies for a Multi-Scale Neuromorphic Hardware Cluster", "author": "Kai Zoschke, Maurice Güttler, Lars Böttcher, Andreas Grübl, Dan Husmann, Johannes Schemmel, Karlheinz Meier, Oswin Ehrmann", "published": "2018-01-15", "arxiv_url": "http://arxiv.org/abs/1801.04734v1", "arxiv_id": "1801.04734v1"}
{"abstraction": "It is well known that the spin Hall effect of light (SHEL) can be easily\nobserved via weak measurement by the dark strip resulted from the splitting of\ndifferent polarization components. We find that the SHEL of partially coherent\nbeam (PCB) also has similar phenomenon. However, the existence of the dark\nstrip in the SHEL of PCB can not be properly justified by considering the beam\nas a statistical assemble of coherent speckles. Also, the dark strip of PCB is\nnot purely dark. By analyzing the autocorrelation of the central dark strip\npart of the SHEL of PCB, we show that SHEL of PCB is essentially the direct\nresult of overlapping coherent speckles' SHEL. Then we further prove our\nconclusion by adjusting the converging level and the incident angle of the\nbeam. Finally, we develop a qualitative theory by taking the intensity\ndistribution of PCB into account, to fully clarify the SHEL of PCB. The\nfeasibility of our theory to Goos-H\\\"anchen (GH) scenario is also demonstrated.", "title": "Observing spin Hall effect of pseudo-thermal light through weak measurement", "author": "Bin Cao, Dong Wei, Pei Zhang, Hong Gao, Fuli Li", "published": "2016-03-30", "arxiv_url": "http://arxiv.org/abs/1603.09395v1", "arxiv_id": "1603.09395v1"}
{"abstraction": "Printed Circuit boards (PCBs) are one of the most important stages in making\nelectronic products. A small defect in PCBs can cause significant flaws in the\nfinal product. Hence, detecting all defects in PCBs and locating them is\nessential. In this paper, we propose an approach based on denoising\nconvolutional autoencoders for detecting defective PCBs and to locate the\ndefects. Denoising autoencoders take a corrupted image and try to recover the\nintact image. We trained our model with defective PCBs and forced it to repair\nthe defective parts. Our model not only detects all kinds of defects and\nlocates them, but it can also repair them as well. By subtracting the repaired\noutput from the input, the defective parts are located. The experimental\nresults indicate that our model detects the defective PCBs with high accuracy\n(97.5%) compare to state of the art works.", "title": "PCB Defect Detection Using Denoising Convolutional Autoencoders", "author": "Saeed Khalilian, Yeganeh Hallaj, Arian Balouchestani, Hossein Karshenas, Amir Mohammadi", "published": "2020-08-28", "arxiv_url": "http://arxiv.org/abs/2008.12589v1", "arxiv_id": "2008.12589v1"}
{"abstraction": "Electronics prototyping using breakout boards allows designers with and\nwithout an engineering background to rapidly create interactive prototypes.\nHowever, when it comes to transition to a production-ready PCB design,\nstagnation exists due to the high skill floor required for PCB design. While\nPCB design automation has been used successfully in recent research tools to\nreduce the required expertise, little has been done to integrate these tools\ndirectly into the electronics prototyping cycle. This position paper aims to\nbring attention to the possibility of integrating recent PCB design automation\nparadigms into the electronics prototyping cycle for the creation of PCB-ready\nbreakout boards: breakout boards whose designs would have the ability to be\npipelined directly into new user interfaces that leverage the use of automation\nfor the rapid creation of production-ready PCB designs.", "title": "PCB-ready breakout boards: Bridging the gap between electronics prototyping and production", "author": "J. Garza, Steven Swanson", "published": "2023-03-12", "arxiv_url": "http://arxiv.org/abs/2303.06620v2", "arxiv_id": "2303.06620v2"}
{"abstraction": "The ubiquitous presence of printed circuit boards (PCBs) in modern electronic\nsystems and embedded devices makes their integrity a top security concern. To\ntake advantage of the economies of scale, today's PCB design and manufacturing\nare often performed by suppliers around the globe, exposing them to many\nsecurity vulnerabilities along the segmented PCB supply chain. Moreover, the\nincreasing complexity of the PCB designs also leaves ample room for numerous\nsneaky board-level attacks to be implemented throughout each stage of a PCB's\nlifetime, threatening many electronic devices. In this paper, we propose\nPDNPulse, a power delivery network (PDN) based PCB anomaly detection framework\nthat can identify a wide spectrum of board-level malicious modifications.\nPDNPulse leverages the fact that the PDN's characteristics are inevitably\naffected by modifications to the PCB, no matter how minuscule. By detecting\nchanges to the PDN impedance profile and using the Frechet distance-based\nanomaly detection algorithms, PDNPulse can robustly and successfully discern\nmalicious modifications across the system. Using PDNPulse, we conduct extensive\nexperiments on seven commercial-off-the-shelf PCBs, covering different design\nscales, different threat models, and seven different anomaly types. The results\nconfirm that PDNPulse creates an effective security asymmetry between attack\nand defense.", "title": "PDNPulse: Sensing PCB Anomaly with the Intrinsic Power Delivery Network", "author": "Huifeng Zhu, Haoqi Shan, Dean Sullivan, Xiaolong Guo, Yier Jin, Xuan Zhang", "published": "2022-04-05", "arxiv_url": "http://arxiv.org/abs/2204.02482v2", "arxiv_id": "2204.02482v2"}
{"abstraction": "In the context of hardware trust and assurance, reverse engineering has been\noften considered as an illegal action. Generally speaking, reverse engineering\naims to retrieve information from a product, i.e., integrated circuits (ICs)\nand printed circuit boards (PCBs) in hardware security-related scenarios, in\nthe hope of understanding the functionality of the device and determining its\nconstituent components. Hence, it can raise serious issues concerning\nIntellectual Property (IP) infringement, the (in)effectiveness of\nsecurity-related measures, and even new opportunities for injecting hardware\nTrojans. Ironically, reverse engineering can enable IP owners to verify and\nvalidate the design. Nevertheless, this cannot be achieved without overcoming\nnumerous obstacles that limit successful outcomes of the reverse engineering\nprocess. This paper surveys these challenges from two complementary\nperspectives: image processing and machine learning. These two fields of study\nform a firm basis for the enhancement of efficiency and accuracy of reverse\nengineering processes for both PCBs and ICs. In summary, therefore, this paper\npresents a roadmap indicating clearly the actions to be taken to fulfill\nhardware trust and assurance objectives.", "title": "Hardware Trust and Assurance through Reverse Engineering: A Survey and Outlook from Image Analysis and Machine Learning Perspectives", "author": "Ulbert J. Botero, Ronald Wilson, Hangwei Lu, Mir Tanjidur Rahman, Mukhil A. Mallaiyan, Fatemeh Ganji, Navid Asadizanjani, Mark M. Tehranipoor, Damon L. Woodard, Domenic Forte", "published": "2020-02-11", "arxiv_url": "http://arxiv.org/abs/2002.04210v2", "arxiv_id": "2002.04210v2"}
{"abstraction": "This paper proposes an optimization of an existing Deep Neural Network (DNN)\nthat improves its hardware utilization and facilitates on-device training for\nresource-constrained edge environments. We implement efficient parameter\nreduction strategies on Xception that shrink the model size without sacrificing\naccuracy, thus decreasing memory utilization during training. We evaluate our\nmodel in two experiments: Caltech-101 image classification and PCB defect\ndetection and compare its performance against the original Xception and\nlightweight models, EfficientNetV2B1 and MobileNetV2. The results of the\nCaltech-101 image classification show that our model has a better test accuracy\n(76.21%) than Xception (75.89%), uses less memory on average (847.9MB) than\nXception (874.6MB), and has faster training and inference times. The\nlightweight models overfit with EfficientNetV2B1 having a 30.52% test accuracy\nand MobileNetV2 having a 58.11% test accuracy. Both lightweight models have\nbetter memory usage than our model and Xception. On the PCB defect detection,\nour model has the best test accuracy (90.30%), compared to Xception (88.10%),\nEfficientNetV2B1 (55.25%), and MobileNetV2 (50.50%). MobileNetV2 has the least\naverage memory usage (849.4MB), followed by our model (865.8MB), then\nEfficientNetV2B1 (874.8MB), and Xception has the highest (893.6MB). We further\nexperiment with pre-trained weights and observe that memory usage decreases\nthereby showing the benefits of transfer learning. A Pareto analysis of the\nmodels' performance shows that our optimized model architecture satisfies\naccuracy and low memory utilization objectives.", "title": "Achieving Pareto Optimality using Efficient Parameter Reduction for DNNs in Resource-Constrained Edge Environment", "author": "Atah Nuh Mih, Alireza Rahimi, Asfia Kawnine, Francis Palma, Monica Wachowicz, Rickey Dubay, Hung Cao", "published": "2024-03-14", "arxiv_url": "http://arxiv.org/abs/2403.10569v1", "arxiv_id": "2403.10569v1"}
{"abstraction": "For one PCB trace region, where bare high voltage trace goes near GND pad, we\nestimated an electrical breakdown voltage in low vacuum using simplified\ngeometrical model under some assumptions. Experimental measurement of Paschen\ncurve for the PCB board considered was proceed in pressure range from 2x10-3\nmbar to 25 mbar.", "title": "Paschen curve for a PCB trace in low vacuum", "author": "N. Atanov, S. Bini, S. Ceravolo, G. Corradi, R. Donghia", "published": "2020-10-13", "arxiv_url": "http://arxiv.org/abs/2010.06570v1", "arxiv_id": "2010.06570v1"}
{"abstraction": "Quite often, we observe reliability data with two failure modes that may\ninfluence each other, resulting in a setting of dependent failure modes. Here,\nwe discuss modelling of censored reliability data with two dependent failure\nmodes by using a bivariate Weibull model with distinct shape parameters which\nwe construct as an extension of the well-known Marshall-Olkin bivariate\nexponential model in reliability. Likelihood inference for modelling censored\nreliability data with two dependent failure modes by using the proposed\nbivariate Weibull distribution with distinct shape parameters is discussed.\nBayesian analysis for this issue is also discussed. Through a Monte Carlo\nsimulation study, the proposed methods of inference are observed to provide\nsatisfactory results. A problem of practical interest for reliability engineers\nis to predict field failures of units at a future time. Frequentist and\nBayesian methods for prediction of future failures are developed in this\nsetting of censored reliability data with two dependent failure modes. An\nillustrative example based on a real data on device failure with two failure\nmodes is presented. The model and methodology presented in this article provide\na complete and comprehensive treatment of modelling censored reliability data\nwith two dependent failure modes, and address some practical prediction issues.", "title": "A Model for Censored Reliability Data with Two Dependent Failure Modes and Prediction of Future Failures", "author": "Aakash Agrawal, Debanjan Mitra, Ayon Ganguly", "published": "2022-06-26", "arxiv_url": "http://arxiv.org/abs/2206.12892v1", "arxiv_id": "2206.12892v1"}
{"abstraction": "Failure management plays a significant role in optical networks. It ensures\nsecure operation, mitigates potential risks, and executes proactive protection.\nMachine learning (ML) is considered to be an extremely powerful technique for\nperforming comprehensive data analysis and complex network management and is\nwidely utilized for failure management in optical networks to revolutionize the\nconventional manual methods. In this study, the background of failure\nmanagement is introduced, where typical failure tasks, physical objects, ML\nalgorithms, data source, and extracted information are illustrated in detail.\nAn overview of the applications of ML in failure management is provided in\nterms of alarm analysis, failure prediction, failure detection, failure\nlocalization, and failure identification. Finally, the future directions on ML\nfor failure management are discussed from the perspective of data, model, task,\nand emerging techniques.", "title": "A Review of Machine Learning-based Failure Management in Optical Networks", "author": "Danshi Wang, Chunyu Zhang, Wenbin Chen, Hui Yang, Min Zhang, Alan Pak Tao Lau", "published": "2022-08-23", "arxiv_url": "http://arxiv.org/abs/2208.10677v1", "arxiv_id": "2208.10677v1"}
{"abstraction": "A study on the behavior of off-site AC power failure recovery times at three\nnuclear plant sites is presented. It is shown, that power law is appropriate\nfor the representation of failure frequency-duration correlation function of\noff-site power failure events, based on simple assumptions about component\nfailure and repair rates. It is also found that the annual maxima of power\nfailure duration follow Frechet distribution, which is a type II asymptotic\ndistribution, strengthening our assumption of power law for the parent\ndistribution. The extreme value distributions obtained are used to extrapolate\nfor failure durations beyond the observed range.", "title": "The power law character of off-site power failures", "author": "A. John Arul, C. Senthil Kumar, S. Marimuthu, Om Pal Singh", "published": "2003-03-17", "arxiv_url": "http://arxiv.org/abs/physics/0303067v1", "arxiv_id": "physics/0303067v1"}
{"abstraction": "The temperature dependence of conductivity of partially dehydrochlorinated\nPVC films, containing in their macromolecules chains of polyene-conjugated\nbonds (PCB) and representing copolymer PVC-Polyacetylene. In samples with\nexcess of some \"threshold\" concentration of PCB with increasing temperature it\nwas found conductivity switching on 10 -11 orders of magnitude. Instability of\nstates with high conductivity in the temperature range which depends on the\nconcentration of PCB was detected. Qualitatively, the increase of concentration\nof PCB was monitored by fixing the fluorescent and absorption spectra.", "title": "Investigation of the influence of temperature on the conductive properties of copolymer PVC -PolyAcetylene films", "author": "D. V. Vlasov, V. I. Kryshtob, T. V. Vlasova, L. A. Apresyan, S. I. Rasmagin", "published": "2013-12-26", "arxiv_url": "http://arxiv.org/abs/1312.7101v1", "arxiv_id": "1312.7101v1"}
{"abstraction": "Element segmentation is a key step in nondestructive testing of Printed\nCircuit Boards (PCB) based on Computed Tomography (CT) technology. In recent\nyears, the rapid development of self-supervised pretraining technology can\nobtain general image features without labeled samples, and then use a small\namount of labeled samples to solve downstream tasks, which has a good potential\nin PCB element segmentation. At present, Masked Image Modeling (MIM)\npretraining model has been initially applied in PCB CT image element\nsegmentation. However, due to the small and regular size of PCB elements such\nas vias, wires, and pads, the global visual field has redundancy for a single\nelement reconstruction, which may damage the performance of the model. Based on\nthis issue, we propose an efficient pretraining model based on multi-scale\nlocal visual field feature reconstruction for PCB CT image element segmentation\n(EMLR-seg). In this model, the teacher-guided MIM pretraining model is\nintroduced into PCB CT image element segmentation for the first time, and a\nmulti-scale local visual field extraction (MVE) module is proposed to reduce\nredundancy by focusing on local visual fields. At the same time, a simple\n4-Transformer-blocks decoder is used. Experiments show that EMLR-seg can\nachieve 88.6% mIoU on the PCB CT image dataset we proposed, which exceeds 1.2%\nby the baseline model, and the training time is reduced by 29.6 hours, a\nreduction of 17.4% under the same experimental condition, which reflects the\nadvantage of EMLR-seg in terms of performance and efficiency.", "title": "Efficient Pretraining Model based on Multi-Scale Local Visual Field Feature Reconstruction for PCB CT Image Element Segmentation", "author": "Chen Chen, Kai Qiao, Jie Yang, Jian Chen, Bin Yan", "published": "2024-05-09", "arxiv_url": "http://arxiv.org/abs/2405.05745v1", "arxiv_id": "2405.05745v1"}
{"abstraction": "With the rapid growth of the PCB manufacturing industry, there is an\nincreasing demand for computer vision inspection to detect defects during\nproduction. Improving the accuracy and generalization of PCB defect detection\nmodels remains a significant challenge. This paper proposes a high-precision,\nrobust, and real-time end-to-end method for PCB defect detection based on deep\nConvolutional Neural Networks (CNN). Traditional methods often suffer from low\naccuracy and limited applicability. We propose a novel approach combining\nYOLOv5 and multiscale modules for hierarchical residual-like connections. In\nPCB defect detection, noise can confuse the background and small targets. The\nYOLOv5 model provides a strong foundation with its real-time processing and\naccurate object detection capabilities. The multi-scale module extends\ntraditional approaches by incorporating hierarchical residual-like connections\nwithin a single block, enabling multiscale feature extraction. This\nplug-and-play module significantly enhances performance by extracting features\nat multiple scales and levels, which are useful for identifying defects of\nvarying sizes and complexities. Our multi-scale architecture integrates feature\nextraction, defect localization, and classification into a unified network.\nExperiments on a large-scale PCB dataset demonstrate significant improvements\nin precision, recall, and F1-score compared to existing methods. This work\nadvances computer vision inspection for PCB defect detection, providing a\nreliable solution for high-precision, robust, real-time, and domain-adaptive\ndefect detection in the PCB manufacturing industry.", "title": "YOLO-pdd: A Novel Multi-scale PCB Defect Detection Method Using Deep Representations with Sequential Images", "author": "Bowen Liu, Dongjie Chen, Xiao Qi", "published": "2024-07-22", "arxiv_url": "http://arxiv.org/abs/2407.15427v1", "arxiv_id": "2407.15427v1"}
{"abstraction": "Previous works for PCB defect detection based on image difference and image\nprocessing techniques have already achieved promising performance. However,\nthey sometimes fall short because of the unaccounted defect patterns or\nover-sensitivity about some hyper-parameters. In this work, we design a deep\nmodel that accurately detects PCB defects from an input pair of a detect-free\ntemplate and a defective tested image. A novel group pyramid pooling module is\nproposed to efficiently extract features of a large range of resolutions, which\nare merged by group to predict PCB defect of corresponding scales. To train the\ndeep model, a dataset is established, namely DeepPCB, which contains 1,500\nimage pairs with annotations including positions of 6 common types of PCB\ndefects. Experiment results validate the effectiveness and efficiency of the\nproposed model by achieving $98.6\\%$ mAP @ 62 FPS on DeepPCB dataset. This\ndataset is now available at: https://github.com/tangsanli5201/DeepPCB.", "title": "Online PCB Defect Detector On A New PCB Defect Dataset", "author": "Sanli Tang, Fan He, Xiaolin Huang, Jie Yang", "published": "2019-02-17", "arxiv_url": "http://arxiv.org/abs/1902.06197v1", "arxiv_id": "1902.06197v1"}
{"abstraction": "Outsourced printed circuit board (PCB) fabrication necessitates increased\nhardware assurance capabilities. Several assurance techniques based on\nautomated optical inspection (AOI) have been proposed that leverage PCB images\nacquired using digital cameras. We review state-of-the-art AOI techniques and\nobserve a strong, rapid trend toward machine learning (ML) solutions. These\nrequire significant amounts of labeled ground truth data, which is lacking in\nthe publicly available PCB data space. We contribute the FICS PCB Image\nCollection (FPIC) dataset to address this need. Additionally, we outline new\nhardware security methodologies enabled by our data set.", "title": "FPIC: A Novel Semantic Dataset for Optical PCB Assurance", "author": "Nathan Jessurun, Olivia P. Dizon-Paradis, Jacob Harrison, Shajib Ghosh, Mark M. Tehranipoor, Damon L. Woodard, Navid Asadizanjani", "published": "2022-02-17", "arxiv_url": "http://arxiv.org/abs/2202.08414v2", "arxiv_id": "2202.08414v2"}
{"abstraction": "A Bill of Materials (BoM) is a list of all components on a printed circuit\nboard (PCB). Since BoMs are useful for hardware assurance, automatic BoM\nextraction (AutoBoM) is of great interest to the government and electronics\nindustry. To achieve a high-accuracy AutoBoM process, domain knowledge of PCB\ntext and logos must be utilized. In this study, we discuss the challenges\nassociated with automatic PCB marking extraction and propose 1) a plan for\ncollecting salient PCB marking data, and 2) a framework for incorporating this\ndata for automatic PCB assurance. Given the proposed dataset plan and\nframework, subsequent future work, implications, and open research\npossibilities are detailed.", "title": "Framework for Automatic PCB Marking Detection and Recognition for Hardware Assurance", "author": "Olivia P. Dizon-Paradis, Daniel E. Capecci, Nathan T. Jessurun, Damon L. Woodard, Mark M. Tehranipoor, Navid Asadizanjani", "published": "2023-07-24", "arxiv_url": "http://arxiv.org/abs/2307.13105v1", "arxiv_id": "2307.13105v1"}
{"abstraction": "The disposal and recycling of electronic waste (e-waste) is a global\nchallenge. The disassembly of components is a crucial step towards an efficient\nrecycling process, avoiding the destructive methods. Although most disassembly\nwork is still done manually due to the diversity and complexity of components,\nthere is a growing interest in developing automated methods to improve\nefficiency and reduce labor costs. This study aims to robotize the desoldering\nprocess and extracting components from printed circuit boards (PCBs), with the\ngoal of automating the process as much as possible. The proposed strategy\nconsists of several phases, including the controlled contact of the robotic\ntool with the PCB components. A specific tool was developed to apply a\ncontrolled force against the PCB component, removing it from the board. The\nresults demonstrate that it is feasible to remove the PCB components with a\nhigh success rate (approximately 100% for the bigger PCB components).", "title": "An in-Contact Robotic System for the Process of Desoldering PCB Components", "author": "Silvia Santos, Lino Marques, Pedro Neto", "published": "2024-03-08", "arxiv_url": "http://arxiv.org/abs/2403.05309v1", "arxiv_id": "2403.05309v1"}
{"abstraction": "Printed circuit boards (PCBs) are an integral part of electronic systems.\nHence, verifying their physical integrity in the presence of supply chain\nattacks (e.g., tampering and counterfeiting) is of utmost importance. Recently,\ntamper detection techniques grounded in impedance characterization of PCB's\nPower Delivery Network (PDN) have gained prominence due to their global\ndetection coverage, non-invasive, and low-cost nature. Similar to other\nphysical verification methods, these techniques rely on the existence of a\nphysical golden sample for signature comparisons. However, having access to a\nphysical golden sample for golden signature extraction is not feasible in many\nreal-world scenarios. In this work, we assess the feasibility of eliminating a\nphysical golden sample and replacing it with a simulated golden signature\nobtained by the PCB design files. By performing extensive simulation and\nmeasurements on an in-house designed PCB, we demonstrate how the parasitic\nimpedance of the PCB components plays a major role in reaching a successful\nverification. Based on the obtained results and using statistical metrics, we\nshow that we can mitigate the discrepancy between collected signatures from\nsimulation and measurements.", "title": "Parasitic Circus:On the Feasibility of Golden Free PCB Verification", "author": "Maryam Saadat Safa, Patrick Schaumont, Shahin Tajik", "published": "2024-03-18", "arxiv_url": "http://arxiv.org/abs/2403.12252v1", "arxiv_id": "2403.12252v1"}
{"abstraction": "Starting from two case histories, where only after thorough Failure Analysis\nthe suddenly appearance of a failure was linked to much earlier events, the\npossibility of improving the reliability and of adjusting the reliability\nprediction tools are discussed.", "title": "Failure Analysis and Field Failures: a Real Shortcut to Reliability Improvement", "author": "G. Mura, G. Cassanelli", "published": "2007-09-12", "arxiv_url": "http://arxiv.org/abs/0709.1875v1", "arxiv_id": "0709.1875v1"}
{"abstraction": "It is effective to improve the reliability and availability of large-scale\ncluster systems through the analysis of failures. Existed failure analysis\nmethods understand and analyze failures from one or few dimension. The analysis\nresults are partial and with less precision because of the limitation of data\nsource. This paper presents multidimensional analysis based on graph mining to\nanalyze multi-source system logs, which is a promising failure analysis method\nto get more complete and precise failure knowledge.", "title": "Multidimensional Analysis of System Logs in Large-scale Cluster Systems", "author": "Wei Zhou, Jianfeng Zhan, Dan Meng", "published": "2009-06-07", "arxiv_url": "http://arxiv.org/abs/0906.1328v1", "arxiv_id": "0906.1328v1"}
{"abstraction": "We consider networks in which random walkers are removed because of the\nfailure of specific nodes. We interpret the rate of loss as a measure of the\nimportance of nodes, a notion we denote as failure-centrality. We show that the\ndegree of the node is not sufficient to determine this measure and that, in a\nfirst approximation, the shortest loops through the node have to be taken into\naccount. We propose approximations of the failure-centrality which are valid\nfor temporal-varying failures and we dwell on the possibility of externally\nchanging the relative importance of nodes in a given network, by exploiting the\ninterference between the loops of a node and the cycles of the temporal pattern\nof failures. In the limit of long failure cycles we show analytically that the\nescape in a node is larger than the one estimated from a stochastic failure\nwith the same failure probability. We test our general formalism in two\nreal-world networks (air-transportation and e-mail users) and show how\ncommunities lead to deviations from predictions for failures in hubs.", "title": "Temporal-varying failures of nodes in networks", "author": "Georgie Knight, Giampaolo Cristadoro, Eduardo G. Altmann", "published": "2015-07-07", "arxiv_url": "http://arxiv.org/abs/1507.01716v1", "arxiv_id": "1507.01716v1"}
{"abstraction": "Despite huge gains in performance in natural language understanding via large\nlanguage models in recent years, voice assistants still often fail to meet user\nexpectations. In this study, we conducted a mixed-methods analysis of how voice\nassistant failures affect users' trust in their voice assistants. To illustrate\nhow users have experienced these failures, we contribute a crowdsourced dataset\nof 199 voice assistant failures, categorized across 12 failure sources. Relying\non interview and survey data, we find that certain failures, such as those due\nto overcapturing users' input, derail user trust more than others. We\nadditionally examine how failures impact users' willingness to rely on voice\nassistants for future tasks. Users often stop using their voice assistants for\nspecific tasks that result in failures for a short period of time before\nresuming similar usage. We demonstrate the importance of low stakes tasks, such\nas playing music, towards building trust after failures.", "title": "A Mixed-Methods Approach to Understanding User Trust after Voice Assistant Failures", "author": "Amanda Baughan, Allison Mercurio, Ariel Liu, Xuezhi Wang, Jilin Chen, Xiao Ma", "published": "2023-03-01", "arxiv_url": "http://arxiv.org/abs/2303.00164v2", "arxiv_id": "2303.00164v2"}
{"abstraction": "The thermal management of an outdoor electronic enclosure can be quite\nchallenging due to the additional thermal load from the sun and the requirement\nof having an air-sealed enclosure. It is essential to consider the effect of\nsolar heating loads in the design process; otherwise, it can shorten the life\nexpectancy of the electronic product or lead to catastrophic failure. In this\npaper we analyze and compare the effectiveness of different cooling techniques\nused for outdoor electronics. Various cooling techniques were compared like\nspecial coatings and paints on the outer surface, radiation shields,\ndouble-walled vented enclosures, fans for internal air circulation and\nair-to-air heat exchangers. A highly simplified, typical outdoor system was\nselected for this study measuring approximately 300x300x400 mm (WxLxH). Solar\nradiation was incident on 3 sides of the enclosure. There were 8 equally spaced\nPCBs inside the enclosure dissipating 12.5W each uniformly (100 watts total). A\ncomputational fluid dynamics (CFD) model of the system was built and analyzed.\nThis was followed by building a mock-up of the system and conducting\nexperiments to validate the CFD model. It was found that some of the simplest\ncooling techniques like white oil paint on the outer surface can significantly\nreduce the impact of solar loads. Adding internal circulation fans can also be\nvery effective. Using air-to-air heat exchangers was found to be the most\neffective solution although it is more complex and costly.", "title": "Evaluation of Cooling Solutions for Outdoor Electronics", "author": "Mahendra Wankhede, V. Khaire, A. Goswami, S. D. Mahajan", "published": "2008-01-07", "arxiv_url": "http://arxiv.org/abs/0801.1043v1", "arxiv_id": "0801.1043v1"}
{"abstraction": "As the number of qubits in nascent quantum processing units increases, the\nconnectorized RF (radio frequency) analog circuits used in first generation\nexperiments become exceedingly complex. The physical size, cost and electrical\nfailure rate all become limiting factors in the extensibility of control\nsystems. We have developed a series of compact RF mixing boards to address this\nchallenge by integrating I/Q quadrature mixing, IF(intermediate\nfrequency)/LO(local oscillator)/RF power level adjustments, and DC (direct\ncurrent) bias fine tuning on a 40 mm $\\times $ 80 mm 4-layer PCB (printed\ncircuit board) board with EMI (electromagnetic interference) shielding. The RF\nmixing module is designed to work with RF and LO frequencies between 2.5 and\n8.5 GHz. The typical image rejection and adjacent channel isolation are\nmeasured to be $\\sim$27 dBc and $\\sim$50 dB. By scanning the drive phase in a\nloopback test, the module short-term amplitude and phase linearity are\ntypically measured to be 5$\\times$10$^{-4}$\n(V$_{\\mathrm{pp}}$/V$_{\\mathrm{mean}}$) and 1$\\times$10$^{-3}$ radian (pk-pk).\nThe operation of RF mixing board was validated by integrating it into the room\ntemperature control system of a superconducting quantum processor and executing\nrandomized benchmarking characterization of single and two qubit gates. We\nmeasured a single-qubit process infidelity of $9.3(3) \\times 10^{-4}$ and a\ntwo-qubit process infidelity of $2.7(1) \\times 10^{-2}$.", "title": "Radio frequency mixing modules for superconducting qubit room temperature control systems", "author": "Yilun Xu, Gang Huang, David I. Santiago, Irfan Siddiqi", "published": "2020-12-31", "arxiv_url": "http://arxiv.org/abs/2101.00066v3", "arxiv_id": "2101.00066v3"}
{"abstraction": "Operating units often experience various failure modes in complex systems,\nleading to distinct degradation paths. Relying on a prognostic model trained on\na single failure mode may lead to poor generalization performance across\nmultiple failure modes. Therefore, accurately identifying the failure mode is\nof critical importance. Current prognostic approaches either ignore failure\nmodes during degradation or assume known failure mode labels, which can be\nchallenging to acquire in practice. Moreover, the high dimensionality and\ncomplex relations of sensor signals make it challenging to identify the failure\nmodes accurately. To address these issues, we propose a novel failure mode\ndiagnosis method that leverages a dimension reduction technique called UMAP\n(Uniform Manifold Approximation and Projection) to project and visualize each\nunit's degradation trajectory into a lower dimension. Then, using these\ndegradation trajectories, we develop a time series-based clustering method to\nidentify the training units' failure modes. Finally, we introduce a\nmonotonically constrained prognostic model to predict the failure mode labels\nand RUL of the test units simultaneously using the obtained failure modes of\nthe training units. The proposed prognostic model provides failure\nmode-specific RUL predictions while preserving the monotonic property of the\nRUL predictions across consecutive time steps. We evaluate the proposed model\nusing a case study with the aircraft gas turbine engine dataset.", "title": "Degradation Modeling and Prognostic Analysis Under Unknown Failure Modes", "author": "Ying Fu, Ye Kwon Huh, Kaibo Liu", "published": "2024-02-29", "arxiv_url": "http://arxiv.org/abs/2402.19294v1", "arxiv_id": "2402.19294v1"}
{"abstraction": "Printed Circuit Board (PCB) assurance in the optical domain is a crucial\nfield of study. Though there are many existing PCB assurance methods using\nimage processing, computer vision (CV), and machine learning (ML), the PCB\nfield is complex and increasingly evolving so new techniques are required to\novercome the emerging problems. Existing ML-based methods outperform\ntraditional CV methods, however they often require more data, have low\nexplainability, and can be difficult to adapt when a new technology arises. To\novercome these challenges, CV methods can be used in tandem with ML methods. In\nparticular, human-interpretable CV algorithms such as those that extract color,\nshape, and texture features increase PCB assurance explainability. This allows\nfor incorporation of prior knowledge, which effectively reduce the number of\ntrainable ML parameters and thus, the amount of data needed to achieve high\naccuracy when training or retraining an ML model. Hence, this study explores\nthe benefits and limitations of a variety of common computer vision-based\nfeatures for the task of PCB component detection using semantic data. Results\nof this study indicate that color features demonstrate promising performance\nfor PCB component detection. The purpose of this paper is to facilitate\ncollaboration between the hardware assurance, computer vision, and machine\nlearning communities.", "title": "PCB Component Detection using Computer Vision for Hardware Assurance", "author": "Wenwei Zhao, Suprith Gurudu, Shayan Taheri, Shajib Ghosh, Mukhil Azhagan Mallaiyan Sathiaseelan, Navid Asadizanjani", "published": "2022-02-17", "arxiv_url": "http://arxiv.org/abs/2202.08452v1", "arxiv_id": "2202.08452v1"}
{"abstraction": "This research article presents a methodical data-based approach to\nsystematically identify key factors in safety-related failure scenarios, with a\nfocus on complex product-environmental systems in the era of Industry 4.0. The\nstudy addresses the uncertainty arising from the growing complexity of modern\nproducts. The method uses scenario analysis and focuses on failure analysis\nwithin technical product development. The approach involves a derivation of\ninfluencing factors based on information from failure databases. The failures\ndescribed here are documented individually in failure sequence diagrams and\nthen related to each other in a relationship matrix. This creates a network of\npossible failure scenarios from individual failure cases that can be used in\nproduct development. To illustrate the application of the methodology, a case\nstudy of 41 Rapex safety alerts for a hair dryer is presented. The failure\nsequence diagrams and influencing factor relationship matrices show 46\ninfluencing factors that lead to safety-related failures. The predominant harm\nis burns and electric shocks, which are highlighted by the active and passive\nsum diagrams. The research demonstrates a robust method for identifying key\nfactors in safety-related failure scenarios using information from failure\ndatabases. The methodology provides valuable insights into product development\nand emphasizes the frequency of influencing factors and their\ninterconnectedness.", "title": "Formalized Identification Of Key Factors In Safety-Relevant Failure Scenarios", "author": "Tim Maurice Julitz, Nadine Schlüter, Manuel Löwer", "published": "2024-02-28", "arxiv_url": "http://arxiv.org/abs/2402.18194v1", "arxiv_id": "2402.18194v1"}
{"abstraction": "Prognostics and Health Management (PHM) is an emerging engineering discipline\nwhich is concerned with the analysis and prediction of equipment health and\nperformance. One of the key challenges in PHM is to accurately predict\nimpending failures in the equipment. In recent years, solutions for failure\nprediction have evolved from building complex physical models to the use of\nmachine learning algorithms that leverage the data generated by the equipment.\nHowever, failure prediction problems pose a set of unique challenges that make\ndirect application of traditional classification and prediction algorithms\nimpractical. These challenges include the highly imbalanced training data, the\nextremely high cost of collecting more failure samples, and the complexity of\nthe failure patterns. Traditional oversampling techniques will not be able to\ncapture such complexity and accordingly result in overfitting the training\ndata. This paper addresses these challenges by proposing a novel algorithm for\nfailure prediction using Generative Adversarial Networks (GAN-FP). GAN-FP first\nutilizes two GAN networks to simultaneously generate training samples and build\nan inference network that can be used to predict failures for new samples.\nGAN-FP first adopts an infoGAN to generate realistic failure and non-failure\nsamples, and initialize the weights of the first few layers of the inference\nnetwork. The inference network is then tuned by optimizing a weighted loss\nobjective using only real failure and non-failure samples. The inference\nnetwork is further tuned using a second GAN whose purpose is to guarantee the\nconsistency between the generated samples and corresponding labels. GAN-FP can\nbe used for other imbalanced classification problems as well.", "title": "Generative Adversarial Networks for Failure Prediction", "author": "Shuai Zheng, Ahmed Farahat, Chetan Gupta", "published": "2019-10-04", "arxiv_url": "http://arxiv.org/abs/1910.02034v1", "arxiv_id": "1910.02034v1"}
{"abstraction": "Large-scale computing systems today are assembled by numerous computing units\nfor massive computational capability needed to solve problems at scale, which\nenables failures common events in supercomputing scenarios. Considering the\ndemanding resilience requirements of supercomputers today, we present a\nquantitative study on fine-grained failure modeling for contemporary and future\nlarge-scale computing systems. We integrate various types of failures from\ndifferent system hierarchical levels and system components, and summarize the\noverall system failure rates formally. Given that nowadays system-wise failure\nrate needs to be capped under a threshold value for reliability and\ncost-efficiency purposes, we quantitatively discuss different scenarios of\nsystem resilience, and analyze the impacts of resilience to different error\ntypes on the variation of system failure rates, and the correlation of\nhierarchical failure rates. Moreover, we formalize and showcase the resilience\nefficiency of failure-bounded supercomputers today.", "title": "Failure Analysis and Quantification for Contemporary and Future Supercomputers", "author": "Li Tan, Nathan DeBardeleben", "published": "2019-11-05", "arxiv_url": "http://arxiv.org/abs/1911.02118v1", "arxiv_id": "1911.02118v1"}
{"abstraction": "With the sharp increase of power demand, large-scale blackouts in power grids\noccur frequently around the world. Cascading failures are the main causes of\nnetwork outages. Therefore, revealing the complicated cascade mechanism in\ngrids is conducive to design the efficient policy to restrain the failures and\nfurther ensure a stable supply of power to users. Motivated by the recent\nadvances of network dynamics, we proposed a framework based Lyapunov stability\nto analyze the dynamically induced cascading failures in complex networks. We\nabandoned the assumption that the network is stable in traditional static\nfailure models and then detected that small disturbances actually can trigger\ncascading failures in unstable networks. What's worse, such failure usually\naccompanied the overload failure of lines during the equilibriums conversion\nprocess. Through the simulation analysis of the Spanish grid, we summarized\nthat the features of this new failure mode include low incidence, large\ndestructiveness, and fast propagation speed. And it usually tends to occur\nfirst in edge nodes and subsequently propagate to the central nodes. These\nfeatures are consistent with the empirical observation of outages in practice.", "title": "Small disturbances can trigger cascading failures in power grids", "author": "Yubo Huang, Junguo Lu, Weidong Zhang", "published": "2019-07-30", "arxiv_url": "http://arxiv.org/abs/1907.12965v1", "arxiv_id": "1907.12965v1"}
{"abstraction": "We study a cascading edge failure mechanism on a connected random graph with\na prescribed degree sequence, sampled using the configuration model. This\nmechanism prescribes that every edge failure puts an additional strain on the\nremaining network, possibly triggering more failures. We show that under a\ncritical loading mechanism that depends on the global structure of the network,\nthe number of edge failure exhibits scale-free behavior (up to a certain\nthreshold). Our result is a consequence of the failure mechanism and the graph\ntopology. More specifically, the critical loading mechanism leads to scale-free\nfailure sizes for any network where no disconnections take place. The\ndisintegration of the configuration model ensures that the dominant\ncontribution to the failure size comes from edge failures in the giant\ncomponent, for which we show that the scale-free property prevails. We prove\nthis rigorously for sublinear thresholds, and we explain intuitively why the\nanalysis follows through for linear thresholds. Moreover, our result holds for\nother graph structures as well, which we validate with simulation experiments.", "title": "Failure behavior in a connected configuration model under a critical loading mechanism", "author": "Fiona Sloothaak, Lorenzo Federico", "published": "2023-07-16", "arxiv_url": "http://arxiv.org/abs/2307.07987v1", "arxiv_id": "2307.07987v1"}
{"abstraction": "Networked systems are susceptible to cascading failures, where the failure of\nan initial set of nodes propagates through the network, often leading to\nsystem-wide failures. In this work, we propose a multiplex flow network model\nto study robustness against cascading failures triggered by random failures.\nThe model is inspired by systems where nodes carry or support multiple types of\nflows, and failures result in the redistribution of flows within the same layer\nrather than between layers. To represent different types of interdependencies\nbetween the layers of the multiplex network, we define two cases of failure\nconditions: layer-independent overload and layer-influenced overload. We\nprovide recursive equations and their solutions to calculate the steady-state\nfraction of surviving nodes, validate them through a set of simulation\nexperiments, and discuss optimal load-capacity allocation strategies. Our\nresults demonstrate that allocating the total excess capacity to each layer\nproportional to the mean effective load in the layer and distributing that\nexcess capacity equally among the nodes within the layer ensures maximum\nrobustness. The proposed framework for different failure conditions allows us\nto analyze the two overload conditions presented and can be extended to explore\nmore complex interdependent relationships.", "title": "Analysis and Optimization of Robustness in Multiplex Flow Networks Against Cascading Failures", "author": "Orkun İrsoy, Osman Yağan", "published": "2025-02-10", "arxiv_url": "http://arxiv.org/abs/2502.06159v1", "arxiv_id": "2502.06159v1"}
{"abstraction": "This paper studies decision making for Walley's partially consonant belief\nfunctions (pcb). In a pcb, the set of foci are partitioned. Within each\npartition, the foci are nested. The pcb class includes probability functions\nand possibility functions as extreme cases. Unlike earlier proposals for a\ndecision theory with belief functions, we employ an axiomatic approach. We\nadopt an axiom system similar in spirit to von Neumann - Morgenstern's linear\nutility theory for a preference relation on pcb lotteries. We prove a\nrepresentation theorem for this relation. Utility for a pcb lottery is a\ncombination of linear utility for probabilistic lottery and binary utility for\npossibilistic lottery.", "title": "Decision Making with Partially Consonant Belief Functions", "author": "Phan H. Giang, Prakash P. Shenoy", "published": "2012-10-19", "arxiv_url": "http://arxiv.org/abs/1212.2484v1", "arxiv_id": "1212.2484v1"}
{"abstraction": "A high-accuracy calibration of inductive coil sensors based on Printed\nCircuit Board (PCB), commonly used in rotating coil field measurements of\nparticle accelerator magnets, is presented. The amplitude and phase of signals\nwith and without main field suppression are compared in order to simultaneously\ndetermine both the PCB rotation radius and the transverse offset of its plane\nfrom rotation center. The accuracy of planar wire placement on the PCB boards\nis exploited to create loops highly precise in area which rotate at different\nradii. Such an area reproducibility and circuit geometry allow the suppression\nof the fundamental field, enabling the calibration, as well as improving signal\nresolution and mitigating vibration effects. Furthermore, the calibration can\nbe performed dynamically, in-situ during measurements. Calibration accuracy is\nvalidated experimentally by referencing the PCB positions with a Coordinate\nMeasuring Machine (CMM).", "title": "Calibration Technique for Rotating PCB Coil Magnetic Field Sensors", "author": "Joseph DiMarco, Giordana Severino, Pasquale Arpaia", "published": "2019-02-28", "arxiv_url": "http://arxiv.org/abs/1903.00028v1", "arxiv_id": "1903.00028v1"}
{"abstraction": "We present a dataset consisting of high-resolution images of 13 micro-PCBs\ncaptured in various rotations and perspectives relative to the camera, with\neach sample labeled for PCB type, rotation category, and perspective\ncategories. We then present the design and results of experimentation on\ncombinations of rotations and perspectives used during training and the\nresulting impact on test accuracy. We then show when and how well data\naugmentation techniques are capable of simulating rotations vs. perspectives\nnot present in the training data. We perform all experiments using CNNs with\nand without homogeneous vector capsules (HVCs) and investigate and show the\ncapsules' ability to better encode the equivariance of the sub-components of\nthe micro-PCBs. The results of our experiments lead us to conclude that\ntraining a neural network equipped with HVCs, capable of modeling equivariance\namong sub-components, coupled with training on a diversity of perspectives,\nachieves the greatest classification accuracy on micro-PCB data.", "title": "On the Importance of Capturing a Sufficient Diversity of Perspective for the Classification of micro-PCBs", "author": "Adam Byerly, Tatiana Kalganova, Anthony J. Grichnik", "published": "2021-01-27", "arxiv_url": "http://arxiv.org/abs/2101.11164v1", "arxiv_id": "2101.11164v1"}
{"abstraction": "There can be numerous electronic components on a given PCB, making the task\nof visual inspection to detect defects very time-consuming and prone to error,\nespecially at scale. There has thus been significant interest in automatic PCB\ncomponent detection, particularly leveraging deep learning. However, deep\nneural networks typically require high computational resources, possibly\nlimiting their feasibility in real-world use cases in manufacturing, which\noften involve high-volume and high-throughput detection with constrained edge\ncomputing resource availability. As a result of an exploration of efficient\ndeep neural network architectures for this use case, we introduce PCBDet, an\nattention condenser network design that provides state-of-the-art inference\nthroughput while achieving superior PCB component detection performance\ncompared to other state-of-the-art efficient architecture designs. Experimental\nresults show that PCBDet can achieve up to 2$\\times$ inference speed-up on an\nARM Cortex A72 processor when compared to an EfficientNet-based design while\nachieving $\\sim$2-4\\% higher mAP on the FICS-PCB benchmark dataset.", "title": "PCBDet: An Efficient Deep Neural Network Object Detection Architecture for Automatic PCB Component Detection on the Edge", "author": "Brian Li, Steven Palayew, Francis Li, Saad Abbasi, Saeejith Nair, Alexander Wong", "published": "2023-01-23", "arxiv_url": "http://arxiv.org/abs/2301.09268v1", "arxiv_id": "2301.09268v1"}
{"abstraction": "This study proposes an advanced method for surface defect detection in\nprinted circuit boards (PCBs) using an improved YOLOv11 model enhanced with a\ngenerative adversarial network (GAN). The approach focuses on identifying six\ncommon defect types: missing hole, rat bite, open circuit, short circuit, burr,\nand virtual welding. By employing GAN to generate synthetic defect images, the\ndataset is augmented with diverse and realistic patterns, improving the model's\nability to generalize, particularly for complex and infrequent defects like\nburrs. The enhanced YOLOv11 model is evaluated on a PCB defect dataset,\ndemonstrating significant improvements in accuracy, recall, and robustness,\nespecially when dealing with defects in complex environments or small targets.\nThis research contributes to the broader field of electronic design automation\n(EDA), where efficient defect detection is a crucial step in ensuring\nhigh-quality PCB manufacturing. By integrating advanced deep learning\ntechniques, this approach enhances the automation and precision of defect\ndetection, reducing reliance on manual inspection and accelerating\ndesign-to-production workflows. The findings underscore the importance of\nincorporating GAN-based data augmentation and optimized detection architectures\nin EDA processes, providing valuable insights for improving reliability and\nefficiency in PCB defect detection within industrial applications.", "title": "Defect Detection Network In PCB Circuit Devices Based on GAN Enhanced YOLOv11", "author": "Jiayi Huang, Feiyun Zhao, Lieyang Chen", "published": "2025-01-12", "arxiv_url": "http://arxiv.org/abs/2501.06879v1", "arxiv_id": "2501.06879v1"}
{"abstraction": "Cricket, a popular bat-and-ball game in South Asia, is played between two\n11-player teams. The Pakistan Super League (PSL) is a commercial T20 domestic\nleague comprised of six franchise-owned teams, where player selection is\ncompetitive. In this study, an existing role-based ranking structure is\nassessed that evaluates player performance in the context of team belongingness\nto generate optimal Pakistan cricket teams for international tournaments. The\nunderlying assumption is that since cricket is fundamentally a team sport, the\nperformance of players compared to their peers plays a crucial role in their\nselection. To accomplish this, a network is generated using ball-by-ball data\nfrom previous PSL matches (2016-2022), and social network analysis (SNA)\ntechniques such as centrality and clustering coefficient measures, are employed\nto quantify the level of belongingness among Pakistani cricket players within\nthe PSL network. Characteristic network models, such as the Erd\\\"os-R\\'enyi,\nWatts-Strogatz, and Barab\\'asi-Albert models are utilized to gain insights into\nthe small-world properties of the network. By ranking players using centrality\nand clustering coefficient metrics, four teams are formulated, and these teams\nare subsequently compared to the official squad selected by the Pakistan\nCricket Board (PCB) for the recent ICC Men's T20 World Cup in 2022. This\nevaluation sheds light on the allegations of nepotism and favoritism in team\nformations that have been attributed to the PCB over the years. Based on our\nfindings, out of the 18 players in the World Cup squad, 11 were included in the\nteams we formed. While most of the 7 players who were not included in our teams\nwere still selected for the ICC Men's T20 World Cup 2022, they ranked highly in\nour rankings, suggesting their potential and competence.", "title": "Exploring the Role of Network Centrality in Player Selection: A Case Study of Pakistan Super League", "author": "Abeer Khan, Maria Hunaid Samiwala, Abeeha Zawar, Muhammad Qasim Pasta, Shah Jamal Alam", "published": "2024-10-18", "arxiv_url": "http://arxiv.org/abs/2410.14181v1", "arxiv_id": "2410.14181v1"}
{"abstraction": "In studies on complex network systems using graph theory, eigen-analysis is\ntypically performed on an undirected graph model of the network. However, when\nanalyzing cascading failures in a power system, the interactions among failures\nsuggest the need for a directed graph beyond the topology of the power system\nto model directions of failure propagation. To accurately quantify failure\ninteractions for effective mitigation strategies, this paper proposes a\nstochastic interaction graph model and associated eigen-analysis. Different\ntypes of modes on failure propagations are defined and characterized by the\neigenvalues of a stochastic interaction matrix, whose absolute values are\nunity, zero, or in between. Finding and interpreting these modes helps identify\nthe probable patterns of failure propagation, either local or widespread, and\nthe participating components based on eigenvectors. Then, by lowering the\nfailure probabilities of critical components highly participating in a mode of\nwidespread failures, cascading can be mitigated. The validity of the proposed\nstochastic interaction graph model, eigen-analysis and the resulting mitigation\nstrategies is demonstrated using simulated cascading failure data on an NPCC\n140-bus system.", "title": "Analysis and Mitigation of Cascading Failures Using a Stochastic Interaction Graph with Eigen-analysis", "author": "Zhenping Guo, Xiaowen Su, Kai Sun, Byungkwon Park, Srdjan Simunovic", "published": "2025-03-12", "arxiv_url": "http://arxiv.org/abs/2503.09904v1", "arxiv_id": "2503.09904v1"}
{"abstraction": "We use machine learning tools to model the line interaction of failure\ncascading in power grid networks. We first collect data sets of simulated\ntrajectories of possible consecutive line failure following an initial random\nfailure and considering actual constraints in a model power network until the\nsystem settles at a steady state. We use weighted $l_1$-regularized logistic\nregression-based models to find static and dynamic models that capture pairwise\nand latent higher-order lines' failure interactions using pairwise statistical\ndata. The static model captures the failures' interactions near the steady\nstates of the network, and the dynamic model captures the failure unfolding in\na time series of consecutive network states. We test models over independent\ntrajectories of failure unfolding in the network to evaluate their failure\npredictive power. We observe asymmetric, strongly positive, and negative\ninteractions between different lines' states in the network. We use the static\ninteraction model to estimate the distribution of cascade size and identify\ngroups of lines that tend to fail together, and compare against the data. The\ndynamic interaction model successfully predicts the network state for\nlong-lasting failure propagation trajectories after an initial failure.", "title": "Data-Driven Interaction Analysis of Line Failure Cascading in Power Grid Networks", "author": "Abdorasoul Ghasemi, Holger Kantz", "published": "2021-12-02", "arxiv_url": "http://arxiv.org/abs/2112.01061v1", "arxiv_id": "2112.01061v1"}
{"abstraction": "In this paper, we investigate data-driven parameterized modeling of insertion\nloss for transmission lines with respect to design parameters. We first show\nthat direct application of neural networks can lead to non-physics models with\nnegative insertion loss. To mitigate this problem, we propose two deep learning\nsolutions. One solution is to add a regulation term, which represents the\npassive condition, to the final loss function to enforce the negative quantity\nof insertion loss. In the second method, a third-order polynomial expression is\ndefined first, which ensures positiveness, to approximate the insertion loss,\nthen DeepONet neural network structure, which was proposed recently for\nfunction and system modeling, was employed to model the coefficients of\npolynomials. The resulting neural network is applied to predict the\ncoefficients of the polynomial expression. The experimental results on an\nopen-sourced SI/PI database of a PCB design show that both methods can ensure\nthe positiveness for the insertion loss. Furthermore, both methods can achieve\nsimilar prediction results, while the polynomial-based DeepONet method is\nfaster than DeepONet based method in training time.", "title": "Physics-Enforced Modeling for Insertion Loss of Transmission Lines by Deep Neural Networks", "author": "Liang Chen, Lesley Tan", "published": "2021-07-27", "arxiv_url": "http://arxiv.org/abs/2107.12527v2", "arxiv_id": "2107.12527v2"}
{"abstraction": "Flexible PCB quench antennas have been very useful in providing high-quality\nhigh-resolution data in low temperature superconducting magnet tests. Similar\nmulti-sensor arrays have been employed recently to cover a high temperature\nsuperconductor magnet tested at FNAL. In the present work, data taking\nconditions and magnet features to support the analysis framework are discussed.\nThen observations made during complete magnet powering cycles are described and\nanalysis of quench antenna data are presented. Based on results, improvements\nto instrumentation and data taking are debated. Views on the future of flexible\nquench antenna sensors for HTS magnet diagnostics and operational support are\nshared.", "title": "Application of Flex-QA Arrays in HTS Magnet Testing", "author": "Stoyan Stoynev, Vadim V. Kashikhin, Sean Cohan, Joe DiMarco, Oliver Kiemschies, Steve Krave, Nghia Mai, Umesh Sambangi, Venkat Selvamanickam", "published": "2025-02-05", "arxiv_url": "http://arxiv.org/abs/2502.03176v2", "arxiv_id": "2502.03176v2"}
{"abstraction": "Many processes must complete in the presence of failures. Different systems\nrespond to task failure in different ways. The system may resume a failed task\nfrom the failure point (or a saved checkpoint shortly before the failure\npoint), it may give up on the task and select a replacement task from the ready\nqueue, or it may restart the task. The behavior of systems under the first two\nscenarios is well documented, but the third ({\\em RESTART}) has resisted\ndetailed analysis. In this paper we derive tight asymptotic relations between\nthe distribution of {\\em task times} without failures to the {\\em total time}\nwhen including failures, for any failure distribution. In particular, we show\nthat if the task time distribution has an unbounded support then the total time\ndistribution $H$ is always heavy-tailed. Asymptotic expressions are given for\nthe tail of $H$ in various scenarios. The key ingredients of the analysis are\nthe Cram\\'er--Lundberg asymptotics for geometric sums and integral asymptotics,\nthat in some cases are obtained via Tauberian theorems and in some cases by\nbare-hand calculations.", "title": "Asymptotic Behavior of Total Times For Jobs That Must Start Over If a Failure Occurs", "author": "Soeren Asmussen, Pierre Fiorini, Lester Lipsky, Tomasz Rolski, Robert Sheahan", "published": "2007-06-04", "arxiv_url": "http://arxiv.org/abs/0706.0403v1", "arxiv_id": "0706.0403v1"}
{"abstraction": "Cloud management systems provide abstractions and APIs for programmatically\nconfiguring cloud infrastructures. Unfortunately, residual software bugs in\nthese systems can potentially lead to high-severity failures, such as prolonged\noutages and data losses. In this paper, we investigate the impact of failures\nin the context widespread OpenStack cloud management system, by performing\nfault injection and by analyzing the impact of the resulting failures in terms\nof fail-stop behavior, failure detection through logging, and failure\npropagation across components. The analysis points out that most of the\nfailures are not timely detected and notified; moreover, many of these failures\ncan silently propagate over time and through components of the cloud management\nsystem, which call for more thorough run-time checks and fault containment.", "title": "How Bad Can a Bug Get? An Empirical Analysis of Software Failures in the OpenStack Cloud Computing Platform", "author": "Domenico Cotroneo, Luigi De Simone, Pietro Liguori, Roberto Natella, Nematollah Bidokhti", "published": "2019-07-09", "arxiv_url": "http://arxiv.org/abs/1907.04055v1", "arxiv_id": "1907.04055v1"}
{"abstraction": "Scientists form hypotheses and experimentally test them. If a hypothesis\nfails (is refuted), scientists try to explain the failure to eliminate other\nhypotheses. The more precise the failure analysis the more hypotheses can be\neliminated. Thus inspired, we introduce failure explanation techniques for\ninductive logic programming. Given a hypothesis represented as a logic program,\nwe test it on examples. If a hypothesis fails, we explain the failure in terms\nof failing sub-programs. In case a positive example fails, we identify failing\nsub-programs at the granularity of literals. We introduce a failure explanation\nalgorithm based on analysing branches of SLD-trees. We integrate a\nmeta-interpreter based implementation of this algorithm with the test-stage of\nthe Popper ILP system. We show that fine-grained failure analysis allows for\nlearning fine-grained constraints on the hypothesis space. Our experimental\nresults show that explaining failures can drastically reduce hypothesis space\nexploration and learning times.", "title": "Learning logic programs by explaining their failures", "author": "Rolf Morel, Andrew Cropper", "published": "2021-02-18", "arxiv_url": "http://arxiv.org/abs/2102.12551v2", "arxiv_id": "2102.12551v2"}
{"abstraction": "Generally, system failures, such as crash failures, Byzantine failures and so\non, are considered as common reasons for the inconsistencies of distributed\nconsensus and have been extensively studied. In fact, strategic manipulations\nby rational agents do not be ignored for reaching consensus in distributed\nsystem. In this paper, we extend the game-theoretic analysis of consensus and\ndesign an algorithm of rational uniform consensus with general omission\nfailures under the assumption that processes are controlled by rational agents\nand prefer consensus. Different from crashing one, agent with omission failures\nmay crash, or omit to send or receive messages when it should, which leads to\ndifficulty of detecting faulty agents. By combining the possible failures of\nagents at the both ends of a link, we convert omission failure model into link\nstate model to make faulty detection possible. Through analyzing message\npassing mechanism in the distributed system with n agents, among which t agents\nmay commit omission failures, we provide the upper bound on message passing\ntime for reaching consensus on a state among nonfaulty agents, and message\nchain mechanism for validating messages. And then we prove our rational uniform\nconsensus is a Nash equilibrium when n>2t+1, and failure patterns and initial\npreferences are blind (an assumption of randomness). Thus agents could have no\nmotivation to deviate the consensus. Our research strengthens the reliability\nof consensus with omission failures from the perspective of game theory.", "title": "Rational Uniform Consensus with General Omission Failures", "author": "Yansong Zhang, Bo Shen, Yingsi Zhao", "published": "2022-08-16", "arxiv_url": "http://arxiv.org/abs/2208.07740v1", "arxiv_id": "2208.07740v1"}
{"abstraction": "Processing maps are key to guiding the thermo-mechanical processing (TMP) of\nsuperalloys. However, traditional processing maps are incapable of delimiting\nfailure, which is an essential factor to be concerned about during the TMP of\nsuperalloys. Employing isothermal hot compression experiments and finite\nelement analysis (FEA), the present study examined the failure behaviors of a\npowder metallurgy (P/M) Ni-based superalloy and constructed processing maps\nwith failure domains based on the predicted failure threshold. The\nmicromechanical Gurson-Tvergaard-Needleman (GTN) damage model was employed in\nthe FEA to model the cavity-driven intergranular fracture of the superalloy.\nDeformation temperature and strain rate were considered in the range of 1050 ~\n1150 C and 0.001 ~ 1 s-1, respectively. The FEA results reveal that the maximum\ntensile stress locates at the outer budging surfaces of the samples, which\ncauses failure initiation and subsequent propagation into longitudinal cracks,\nbeing consistent with the experiments. It is further demonstrated that the\nfailure is strain-controlled and the critical failure strain remains nearly\ninsensitive to the range of strain rates considered while increasing with the\nincrease of temperature in a third-order polynomial. Finally, an optimized\nprocessing window for hot deformation of the superalloy is formulated to\nwarrant good hot workability while avoiding flow instability and failure. The\npresent study offers direct insights into the failure behaviors of P/M Ni-based\nsuperalloys and details a modeling strategy to delineate optimized parametric\nspaces for the TMP of superalloys.", "title": "Failure behaviors and processing maps with failure domains for hot compression of a powder metallurgy Ni-based superalloy", "author": "Zonglin Chi, Shuai Ren, Jingbo Qiao, Jinglong Qu, Chengbin Yang, Zhuanye Xie, Wei Chen, Hua Zhang, Liang Jiang, Shuying Chen, Fanchao Meng", "published": "2022-08-23", "arxiv_url": "http://arxiv.org/abs/2208.10665v1", "arxiv_id": "2208.10665v1"}
{"abstraction": "Existing models for the analysis of concurrent processes tend to focus on\nfail-stop failures, where processes are either working or permanently stopped,\nand their state (working/stopped) is known. In fact, systems are often affected\nby grey failures: failures that are latent, possibly transient, and may affect\nthe system in subtle ways that later lead to major issues (such as crashes,\nlimited availability, overload). We introduce a model of actor-based systems\nwith grey failures, based on two interlinked layers: an actor model, given as\nan asynchronous process calculus with discrete time, and a failure model that\nrepresents failure patterns to inject in the system. Our failure model captures\nnot only fail-stop node and link failures, but also grey failures (e.g.,\npartial, transient). We give a behavioural equivalence relation based on weak\nbarbed bisimulation to compare systems on the basis of their ability to recover\nfrom failures, and on this basis we define some desirable properties of\nreliable systems. By doing so, we reduce the problem of checking reliability\nproperties of systems to the problem of checking bisimulation.", "title": "A model of actors and grey failures", "author": "Laura Bocchi, Julien Lange, Simon Thompson, A. Laura Voinea", "published": "2022-10-31", "arxiv_url": "http://arxiv.org/abs/2210.17508v4", "arxiv_id": "2210.17508v4"}
{"abstraction": "To coupe with the difficulties in the process of inspection and\nclassification of defects in Printed Circuit Board (PCB), other researchers\nhave proposed many methods. However, few of them published their dataset\nbefore, which hindered the introduction and comparison of new methods. In this\npaper, we published a synthesized PCB dataset containing 1386 images with 6\nkinds of defects for the use of detection, classification and registration\ntasks. Besides, we proposed a reference based method to inspect and trained an\nend-to-end convolutional neural network to classify the defects. Unlike\nconventional approaches that require pixel-by-pixel processing, our method\nfirstly locate the defects and then classify them by neural networks, which\nshows superior performance on our dataset.", "title": "A PCB Dataset for Defects Detection and Classification", "author": "Weibo Huang, Peng Wei", "published": "2019-01-24", "arxiv_url": "http://arxiv.org/abs/1901.08204v1", "arxiv_id": "1901.08204v1"}
{"abstraction": "Design of printed circuit board (PCB) stack-up requires the consideration of\ncharacteristic impedance, insertion loss and crosstalk. As there are many\nparameters in a PCB stack-up design, the optimization of these parameters needs\nto be efficient and accurate. A less optimal stack-up would lead to expensive\nPCB material choices in high speed designs. In this paper, an efficient global\noptimization method using parallel and intelligent Bayesian optimization is\nproposed for the stripline design.", "title": "Machine Learning for high speed channel optimization", "author": "Jiayi He, Aravind Sampath Kumar, Arun Chada, Bhyrav Mutnury, James Drewniak", "published": "2019-11-01", "arxiv_url": "http://arxiv.org/abs/1911.04317v1", "arxiv_id": "1911.04317v1"}
{"abstraction": "We present a magnetic field confining coil with a sub-$10^{-3}$ field\nuniformity over a large fraction of the coil. The structure is entirely made\nout of printed circuit boards (PCBs). The PCB design allows to tailor the path\nof wires to fit the required geometry. We measure the field uniformity with\ncesium magnetometers in a field range from 1 to 10 $\\mu\\mathrm{T}$. Our\napplication uses such a coil for an atomic magnetometry-based current\ncontroller.", "title": "PCB Coil Design Producing a Uniform Confined Magnetic Field", "author": "Peter A. Koss, Christopher Crawford, Georg Bison, Elise Wursten, Malgorzata Kasprzak, Nathal Severijns", "published": "2017-07-20", "arxiv_url": "http://arxiv.org/abs/1707.06414v2", "arxiv_id": "1707.06414v2"}
{"abstraction": "Undoubtedly faster, larger and lower power per bit, but just how do you go\nabout interfacing a DDR3 SDRAM DIMM to an FPGA? The DDR3 standard addresses the\nfaster, more bandwidth and lower power per bit need, but it introduces new\ndesign challenges in addition to challenges introduced by DDR2 ODT, slew rate\nderating, etc. The DDR3 fly-by topology requirement means customers designing\nDDR3 memories must now account for write leveling and read de-skew on the PCB.\nThis paper will cover modeling, simulation, and physical layout approaches\nrequired to meet JEDEC-defined termination and tight timing requirements for\ndesigning DDR3 memory interfaces on PCB systems.", "title": "Challenges in implementing DDR3 memory interface on PCB systems: a methodology for interfacing DDR3 SDRAM DIMM to an FPGA", "author": "Phil Murray, Feras Al-Hawari", "published": "2022-04-07", "arxiv_url": "http://arxiv.org/abs/2204.05107v1", "arxiv_id": "2204.05107v1"}
{"abstraction": "The use of Printed Circuit Boards (PCBs) for the inductive pick-up windings\nof rotating coil probes has made the construction of these precision magnetic\nmeasurement devices much more accessible. This paper discusses the design\ndetails for PCBs which on each layer of the board provide for simultaneous\nanalog bucking (suppression) of dipole, quadrupole, and sextupole field\ncomponents so as to more accurately measure the higher order harmonic fields in\nsextupole magnets. Techniques to generate designs are discussed, as well as\ntrade-offs to optimize sensitivity. Examples of recent sextupole PCBs and their\nperformance are given.", "title": "Printed Circuit Board Based Rotating Coils for Measuring Sextupole Magnets", "author": "J. DiMarco", "published": "2024-01-18", "arxiv_url": "http://arxiv.org/abs/2401.10374v2", "arxiv_id": "2401.10374v2"}
{"abstraction": "We consider a reduced order model of an air-breathing hypersonic engine with\na time-dependent stochastic inflow that may cause the failure of the engine.\nThe probability of failure is analyzed by the Freidlin-Wentzell theory, the\nlarge deviation principle for finite dimensional stochastic differential\nequations. We compute the asymptotic failure probability by numerically solving\nthe constrained optimization related to the large deviation problem. A\nlarge-deviation-based importance sampling suggested by the most probable inflow\nperturbation is also implemented to compute the probability of failure of the\nengine. The numerical simulations show that the importance sampling method is\nmuch more efficient than the basic Monte Carlo method.", "title": "Probability of Failure in Hypersonic Engines Using Large Deviations", "author": "George Papanicolaou, Nicholas West, Tzu-Wei Yang", "published": "2012-08-24", "arxiv_url": "http://arxiv.org/abs/1208.5029v1", "arxiv_id": "1208.5029v1"}
{"abstraction": "This paper quantitatively evaluates structural failure of biaxial\ncohesionless ellipsoids that have a two-density-layer distribution. The\ninternal density layer is modeled as a sphere, while the external density layer\nis the rest of the part. The density is supposed to be constant in each layer.\nThe present study derives averaged stresses over the whole volume of these\nbodies and uses limit analysis to determine their global failure. The upper\nbound condition of global failure is considered in terms of the size of the\ninternal layer and the aspect ratio of the shape. The result shows that the\ntwo-density-layer causes the body to have different strength against structural\nfailure.", "title": "Structural failure of two-density-layer cohesionless biaxial ellipsoids", "author": "Masatoshi Hirabayashi", "published": "2014-02-24", "arxiv_url": "http://arxiv.org/abs/1402.5899v1", "arxiv_id": "1402.5899v1"}
{"abstraction": "This work provides a numerical calculation of shape gradients of failure\nprobabilities for mechanical components using a first discretize, then adjoint\napproach. While deterministic life prediction models for failure mechanisms are\nnot (shape) differentiable, this changes in the case of probabilistic life\nprediction. The probabilistic, or reliability based, approach thus opens the\nway for efficient adjoint methods in the design for mechanical integrity. In\nthis work we propose, implement and validate a method for the numerical\ncalculation of the shape gradients of failure probabilities for the failure\nmechanism low cycle fatigue (LCF), which applies to polycrystalline metal.\nNumerical examples range from a bended rod to a complex geometry from a turbo\ncharger in 3D.", "title": "Shape gradients for the failure probability of a mechanical component under cyclical loading", "author": "Hanno Gottschalk, Mohamed Saadi", "published": "2018-06-12", "arxiv_url": "http://arxiv.org/abs/1806.04389v1", "arxiv_id": "1806.04389v1"}
